Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/analysisprops.po
Languages: ja, pt_br

source: Analysis Properties
ja: 解析プロパティ
pt_br: Propriedades de análise

source: SpotBugs allows several aspects of the analyses it performs to be customized. System properties are used to configure these options. This chapter describes the configurable analysis options.
ja: SpotBugs は，実行する解析の観点をカスタマイズできます。システムプロパティがオプションを設定するために使用されます。この章では，設定可能な解析オプションについて説明します。
pt_br: SpotBugs permite a customização de vários aspectos das análises suportadas. As propriedades do sistema são usadas para configurar essas opções. Este capítulo descreve as opções de análise configuráveis.

source: The analysis options have two main purposes. First, they allow you to inform SpotBugs about the meaning of methods in your application, so that it can produce more accurate results, or produce fewer false warnings. Second, they allow you to configure the precision of the analysis performed. Reducing analysis precision can save memory and analysis time, at the expense of missing some real bugs, or producing more false warnings.
ja: 解析オプションには主に2つの目的があります。1つ目は，SpotBugs にアプリケーションのメソッドの意味を通知し，より正確な結果を生成したり，誤検出を少なくしたりできます。2つ目は，実行される解析の精度を設定できます。解析の精度を下げると，メモリと解析時間を節約できますが，本当のバグを見逃したり，より多くの誤検出を作り出したりします。
pt_br: As opções de análise apresentam dois objetivos principais. Primeiro, as opções de análise permitem que você informe ao SpotBugs sobre o significado dos métodos em sua aplicação, para que ele possa produzir resultados mais precisos ou menos avisos falsos. Segundo, as opções de análise permitem que você configure a precisão da análise realizada. A redução da precisão pode economizar memória e tempo de análise, as custas de perder alguns bugs reais, ou produzir mais avisos falsos.

source: The analysis options are set using the ``-property`` command line option. For example:
ja: 解析オプションは，``-property`` コマンドラインオプションを使用して設定します。たとえば:
pt_br: As opções de análise são definidas usando a opção ``-property`` na linha de comando. Por exemplo:

source: The list of configurable analysis properties is shown in following table:
ja: 設定できる解析プロパティのリストを次の表に示します。
pt_br: A lista de propriedades de análise configuráveis são mostradas na tabela a seguir:

source: Property Name
ja: プロパティ名
pt_br: Nome da propriedade

source: Value
ja: 値
pt_br: Valor

source: Meaning
ja: 意味
pt_br: Significado

source: Comma-separated list of fully qualified method names: e.g., "com.foo.MyClass.checkAssertion"
ja: コンマ区切りの完全就職メソッド名のリスト (例，「com.foo.MyClass.checkAssertion」)
pt_br: Lista separada por vírgulas dos nomes qualificados dos métodos. Por exemplo, "com.foo.MyClass.checkAssertion"

source: This property specifies the names of methods that are used to check program assertions. Specifying these methods allows the null pointer dereference bug detector to avoid reporting false warnings for values which are checked by assertion methods.
ja: このプロパティは，プログラムのアサーションをチェックするために使用されるメソッドの名前を指定します。これらのメソッドを指定すると，null 間接参照バグディテクタは，アサーションメソッドによってチェックされる値に対する誤検出を回避できます。
pt_br: Esta propriedade especifica os nomes dos métodos que são usados para verificar as asserções do programa. A especificação desses métodos permite que o detector de bug para referência nula evite relatar avisos falsos para valores que são verificados por métodos de asserção.

source: true or false
ja: true または false
pt_br: verdadeiro (true) ou falso (false)

source: If true, the DroppedException detector scans source code for empty catch blocks for a comment, and if one is found, does not report a warning.
ja: true のときは，DroppedException ディテクタは空のキャッチブロックにコメントがないかスキャンし，見つかったときは警告を報告しません。
pt_br: Se verdadeiro, o detector DroppedException escaneia o código fonte para capturar blocos de comentários vazios e, se for encontrado, o aviso não é reportado.

source: If true, emit low priority warnings for local variables which obscure fields. Default is false.
ja: true のときは，フィールドを隠蔽するローカル変数に対する優先度の低い警告を発行します。デフォルトは false です。
pt_br: Se verdadeiro, emite avisos de baixa prioridade para variáveis locais com campos obscuros. O valor default é falso.

source: not used (intention: If true, the null dereference detector assumes that any reference value returned from a method or passed to a method in a parameter might be null. Default is false. Note that enabling this property will very likely cause a large number of false warnings to be produced.)
ja: 使わないでください (意図: trueのときは，null 間接参照ディテクタはメソッドから返された，またはメソッドに渡されたパラメータの参照値が null であるとみなします。デフォルトは false です。このプロパティを有効にすると，多数の誤った警告が生成されることに注意してください。)
pt_br: Não usado (intenção: se verdadeiro, o detector de referência nula assume que qualquer valor de referência retornado de um método ou passado como parâmetro para um método pode ser nulo. O valor default é falso. Veja que ao habilitar essa propriedade, muitos avisos falsos podem ser gerados.)

source: If true, all suspicious reference comparisons using the == and != operators are reported.,If false, only one such warning is issued per method.,Default is false.
ja: true のときは，== と != 演算子を使用している疑わしい参照比較がすべて報告されます。false のときは，メソッドごとに警告が1つだけ発行されます。デフォルトは false です。
pt_br: Se verdadeiro, todas as referências suspeitas usando os operadores == e != para comparações são reportadas. Se falso, apenas um aviso é gerado por método.

source: If true, the SwitchFallthrough detector will only report warnings for cases where the source code does not have a comment containing the words "fall" or "nobreak". (An accurate source path must be used for this feature to work correctly.) This helps find cases where the switch fallthrough is likely to be unintentional.
ja: true のときは，SwitchFallthrough ディテクタは，ソースコードに「fall」または「nobreak」という単語がコメントに含まれていないときに警告を報告します。(この機能を正しく動作させるためには，正確なソースパスを使用する必要があります。) これにより，意図的ではない switch 文のフォールスルーを見つけられます。
pt_br: Se verdadeiro, o detector SwitchFallthrough apenas reporta avisos para casos onde o código fonte não tem comentários com as palavras "fall" ou "nobreak". (Um caminho de origem preciso deve ser usado para esse
