Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/eclipse.po
Languages: ja, pt_br

source: Using the SpotBugs Eclipse plugin
ja: SpotBugs Eclipseプラグインの使い方
pt_br: Usando o SpotBugs como plugin do Eclipse

source: The SpotBugs Eclipse plugin allows SpotBugs to be used within the Eclipse IDE. The SpotBugs Eclipse plugin was generously contributed by Peter Friese. Phil Crosby and Andrey Loskutov contributed major improvements to the plugin.
ja: SpotBugs Eclipseプラグインを使用すると SpotBugs を Eclipse IDE 内で使用できます。SpotBugs Eclipseプラグインは，Peter Friese 氏の多大なる貢献によるものです。Phil Crosby 氏と Andrey Loskutov 氏は，プラグインの大幅な改善に貢献しました。
pt_br: O plugin do SpotBugs para o Eclipse permite que o SpotBugs seja usado dentro do IDE Eclipse. O plugin do SpotBugs para o Eclipse foi generosamente contribuído por Peter Friese. Phil Crosby e Andrey Loskutov contribuíram com grandes melhorias para o plugin.

source: Requirements
ja: 必要条件
pt_br: Requisitos

source: To use the SpotBugs Plugin for Eclipse, you need Eclipse Neon (4.6) or later.
ja: SpotdBugs Eclipse プラグインを使用するためには，Eclipse Neon (4.6) 以降が必要です。
pt_br: Para usar o SpotBugs para o Eclipse, você precisa do Eclipse Neon (4.6) ou superior.

source: Installation
ja: インストール
pt_br: Instalação

source: We provide update sites that allow you to automatically install SpotBugs into Eclipse and also query and install updates. There are three different update sites:
ja: 私たちは，SpotBugs を Eclipse に自動的にインストールしたり，アップデートを照会してインストールもできる更新サイトを提供しています。3 つの異なる更新サイトがあります。
pt_br: Oferecemos sites de atualização que permitem instalar automaticamente SpotBugs no Eclipse e também consultar e instalar atualizações. Existem três sites de atualização diferentes:

source: Only provides official releases of SpotBugs Eclipse plugin.
ja: SpotBugs Eclipse プラグインの公式リリースだけを提供します。
pt_br: Fornece apenas as versões oficiais do plugin SpotBugs para o Eclipse.

source: Provides official releases and release candidates of SpotBugs Eclipse plugin.
ja: SpotBugs Eclipse プラグインの公式リリースとリリース候補を提供します。
pt_br: Fornece as versões oficiais e candidatas do plugin SpotBugs para o Eclipse.

source: Provides latest SpotBugs Eclipse plugin built from master branch.
ja: 最新の SpotBugs Eclipse プラグインをマスターブランチからビルドします。
pt_br: Fornece o latest do plugin SpotBugs para o Eclipse construído a partir da branch master.

source: Provides latest SpotBugs Eclipse plugin built from release-3.1 branch.
ja: 最新で安定している SpotBugs Eclipse プラグインを release-3.1 ブランチからビルドします。
pt_br: Fornece o latest do plugin SpotBugs para o Eclipse construído a partir da branch release-3.1.

source: Or just use `Eclipse marketplace <https://marketplace.eclipse.org/content/spotbugs-eclipse-plugin>`_ to install SpotBugs Eclipse plugin.
ja: または `Eclipse marketplace <https://marketplace.eclipse.org/content/spotbugs-eclipse-plugin>`_ を使って SpotBugs Eclipse プラグインをインストールします。
pt_br: Ou apenas use o `Eclipse marketplace <https://marketplace.eclipse.org/content/spotbugs-eclipse-plugin>`_ para instalar o plugin do SpotBugs para o Eclipse.

source: Using the Plugin
ja: プラグインの使い方
pt_br: Usando o plugin

source: To get started, right click on a Java project in Package Explorer, and select the option labeled "Spot Bugs". SpotBugs will run, and problem markers (displayed in source windows, and also in the Eclipse Problems view) will point to locations in your code which have been identified as potential instances of bug patterns.
ja: 開始するには，パッケージエクスプローラで Java プロジェクトを右クリックして，「Spot Bugs」というラベルの付いたオプションを選択します。SpotBugs が実行され，問題マーカー (ソースウインドウと Eclipse の問題ビューに表示されます) は，バグパターンの潜在的なインスタンスとして特定されたコード内の場所を示します。
pt_br: Para começar, clique com o botão direito em um projeto Java no explorador de pacotes (Package Explorer) e selecione a opção "Spot Bugs". O SpotBugs será executado e os marcadores de problemas (exibidos nas janelas de código-fonte e também na visualização de problemas do Eclipse) apontarão para os locais em seu código que foram identificados como instâncias potenciais de padrões de bug.

source: You can also run SpotBugs on existing java archives (jar, ear, zip, war etc). Simply create an empty Java project and attach archives to the project classpath. Having that, you can now right click the archive node in Package Explorer and select the option labeled "Spot Bugs". If you additionally configure the source code locations for the binaries, SpotBugs will also link the generated warnings to the right source files.
ja: 既存の Java アーカイブ (jar，ear，zip，war など) で SpotBugs を実行できます。空の Java プロジェクトを作成し，プロジェクトのクラスパスにアーカイブを追加するだけです。これで，パッケージエクスプローラでアーカイブノードを右クリックして，「SpotBugs」というラベルの付いたオプションを選択できます。さらに，バイナリのソースコードの場所を設定すると，SpotBugs は生成された警告を正しいソースファイルにリンクします。
pt_br: Você também pode executar SpotBugs em arquivos java existentes (jar, ear, zip, war etc.). Basta criar um projeto Java vazio e anexar arquivos ao classpath do projeto. Com isso, agora você pode clicar com o botão direito do mouse no nó do arquivo no Package Explorer e selecionar a opção rotulada "Spot Bugs". Se você configurar adicionalmente os locais do código-fonte para os binários, o SpotBugs também vinculará os avisos gerados aos arquivos-fonte corretos.

source: You may customize how SpotBugs runs by opening the Properties dialog for a Java project, and choosing the "SpotBugs" property page. Options you may choose include:
ja: SpotBugs の実行方法をカスタマイズするには，Java プロジェクトのプロパティダイアログを開き，「SpotBugs」プロパティページを選択します。選択できるオプションは次のとおりです。
pt_br: Você pode personalizar a forma como os SpotBugs é executado abrindo a caixa de diálogo propriedades (Properties) de um projeto Java e escolhendo a página de propriedades "SpotBugs". As opções que você pode escolher incluem:

source: Enable or disable the "Run SpotBugs Automatically" checkbox. When enabled, SpotBugs will run every time you modify a Java class within the project.
ja: 「Run SpotBugs Automatically」チェックボックスを有効または無効にします。有効にすると，プロジェクト内の Java クラスを変更するたびに SpotBugs が実行されます。
pt_br: Ative ou desative a caixa de seleção "Executar SpotBugs automaticamente". Quando ativada, o SpotBugs será executado sempre que você modificar uma classe Java dentro do projeto.

source: Choose minimum warning priority and enabled bug categories. These options will choose which warnings are shown. For example, if you select the "Medium" warning priority, only Medium and High priority warnings will be shown. Similarly, if you uncheck the "Style" checkbox, no warnings in the Style category will be displayed.
ja: 最低限の優先度を選択し，バグカテゴリを有効にします。これらのオプションは，表示される警告を選択します。たとえば，優先度で「Medium」を選択すると，優先度 (中) と優先度 (高) の警告だけが表示されます同様に，「Style」チェックボックスのチェックを外すと，Style カテゴリの警告は表示されません。
pt_br: Escolha a prioridade mínima de aviso e as categorias de bug. Essas opçõesdefinem os avisos que serão mostrados. Por exemplo, se você selecionar a prioridade de aviso média ""Medium", apenas avisos de prioridade média e altaserão mostrados. Da mesma forma, se você desmarcar a caixa de seleção "Style", nenhum avisona categoria estilo será exibido.

source: Select detectors. The table allows you to select which detectors you want to enable for your project.
ja: ディテクタの選択。この表では，プロジェクトで有効にするディテクタを選択できます。
pt_br: Selecione os detectores. A tabela permite que você selecione quais detectores deseja habilitar para o seu projeto.

source: Extending the Eclipse Plugin (since 2.0.0)
ja: Eclipse プラグインの拡張 (2.0.0 以降)
pt_br: Estendendo o plugin do Eclipse (desde 2.0.0)

source: Eclipse plugin supports contribution of custom SpotBugs detectors (see also AddingDetectors.txt for more information). There are two ways to contribute custom plugins to the Eclipse:
ja: Eclipse プラグインは，カスタム SpotBugs ディテクタの寄贈をサポートします (詳細については AddingDetectors.txt も参照してください)。カスタムプラグインを Eclipse に提供するには 2 つの方法があります。
pt_br: O plug-in do Eclipse suporta a contribuição de detectores do SpotBugs personalizados (consulte também AddedDetectors.txt para obter mais informações). Existem duas maneiras de contribuir com plug-ins personalizados para o Eclipse:

source: Existing standard SpotBugs detector packages can be configured via ``Window → Preferences → Java → FindBugs → Misc. Settings → Custom Detectors``. Simply specify there locations of any additional plugin libraries. The benefit of this solution is that already existing detector packages can be used "as is", and that you can quickly verify the quality of third party detectors. The drawback is that you have to apply this settings in each new Eclipse workspace, and this settings can't be shared between team members.
ja: 既存の標準 SpotBugs ディテクタパッケージは，``Window → Preferences → Java → FindBugs → Misc. Settings → Custom Detectors`` で設定できます。追加のプラグインの場所を指定するだけです。このソリューションの利点は，既存のディテクタパッケージを「そのまま」使用でき，サードパーティのディテクタの品質を迅速に検証できることです。欠点は，新しい Eclipse ワークスペースごとにこの設定を適用する必要があり，この設定をチームメンバ間で共有できないことです。
pt_br: Os detectores padrão do SpotBugs detector podem ser configurados via ``Window → Preferences → Java → FindBugs → Misc. Settings → Custom Detectors``. Basta especificar os locais das bibliotecas de qualquer plugin adicional. O benefício desta solução é que os pacotes de detectores existentes podem ser utilizados "as is", e você pode rapidamente verificar a qualidade de detectores terceiros. A desvantagem é que você precisa aplicar as configurações em cada workspace do Eclipse, e as configurações não podem ser compartilhadas entre membros de um time.

source: It is possible to contribute custom detectors via standard Eclipse extensions mechanism.
ja: 標準の Eclipse 拡張機構を用いてカスタムディテクタを提供できます。
pt_br: É possível contribuir com detectores customizados por meio do mecanismo de extensões padrão do Eclipse.

source: Please check the documentation of the ``eclipsePlugin/schema/detectorPlugins.exsd`` extension point how to update the plugin.xml. Existing FindBugs detector plugins can be easily "extended" to be full featured SpotBugs AND Eclipse detector plugins. Usually you only need to add ``META-INF/MANIFEST.MF`` and ``plugin.xml`` to the jar and update your build scripts to not to override the ``MANIFEST.MF`` during the build.
ja: ``eclipsePlugin/schema/detectorPlugins.exsd`` 拡張ポイントのドキュメントを参照して，plugin.xml の更新方法を確認してください。既存の SpotBugs ディテクタプラグインは，完全に機能する SpotBugs ディテクタプラグインになるように簡単に「拡張」できます。通常は，``META-INF/MANIFEST.MF`` と ``plugin.xml`` を jar ファイルに追加し，ビルド時に ``MANIFEST.MF`` を上書きしないようにビルドスクリプトを更新するだけです。
pt_br: Por favor, verifique a documentação do ponto de extensão ``eclipsePlugin/schema/detectorPlugins.exsd`` para saber como atualizar o plugin.xml. Os detectores do plugin FindBugs podem ser facilmente estendidos "extended" para serem detectores do SpotBugs. Você só precisa adicionar o ``META-INF/MANIFEST.MF`` e ``plugin.xml`` ao jar e atualizar seus scripts de construção para não substituir o ``MANIFEST.MF`` durante a construção.

source: The benefit of this solution is that for given (shared) Eclipse installation each team member has exactly same detectors set, and there is no need to configure anything anymore. The (really small) precondition is that you have to convert your existing detectors package to the valid Eclipse plugin. You can do this even for third-party detector packages. Another major differentiator is the ability to extend the default SpotBugs classpath at runtime with required third party libraries (see AddingDetectors.txt for more information).
ja: このソリューションの利点は，Eclipse インストールが共有されていれば，それぞれのチームメンバが正確に同じディテクタセットを持ち，何も設定する必要がないことです。(本当に小さな) 前提条件は，既存のディテクタパッケージを有効な Eclipse プラグインに変換しておくことです。サードパーティのディテクタでもこれを行うことができます。もうひとつの大きな違いは，実行時に必要なサードパーティのライブラリでデフォルトの SpotBugs クラスパスを拡張する能力です (詳細については AddingDetectors.txt を参照してください)。
pt_br: O benefício desta solução é que para determinada instalação (compartilhada) do Eclipse, cada membro da equipe tem exatamente o mesmo conjunto de detectores e não há necessidade de configurar mais nada. A pré-condição (muito pequena) é que você deve converter seu pacote de detectores existente para o plug-in do Eclipse. Você pode fazer isso até mesmo para pacotes de detectores de terceiros. Outro grande diferencial é a capacidade de estender o caminho de classes do SpotBugs padrão em tempo de execução com bibliotecas de terceiros (consulte AddedDetectors.txt para mais informações).

source: Troubleshooting
ja: トラブルシューティング

source: This section lists common problems with the plugin and (if known) how to resolve them.
ja: この節では，プラグインの一般的な問題と (既知の) 問題を解決する方法について説明します。
pt_br: Esta seção lista problemas comuns com o plugin e (se conhecido) como resolvê-los.

source: If you see OutOfMemory error dialogs after starting SpotBugs analysis in Eclipse, please increase JVM available memory: change ``eclipse.ini`` and add the lines below to the end of the file:
ja: Eclipse で SpotBugs の解析を開始した後に OutOfMemory エラーダイアログが表示されるときは，JVM の使用可能なメモリを増やしてください。``eclipse.ini`` を変更し次の行をファイルの最後に追加してください。
pt_br: Se você vir caixas de diálogo de erro OutOfMemory após iniciar a análise do SpotBugs no Eclipse, aumente a memória disponível da JVM: altere o ``eclipse.ini`` e adicione as linhas abaixo ao final do arquivo:

source: Important: the configuration arguments starting with the line ``-vmargs`` must be last lines in the ``eclipse.ini`` file, and only one argument per line is allowed!
ja: 重要: ``-vmargs`` 行から始まる設定引数は ``eclipse.ini`` ファイルの最後でなければならず，1 行につき 1 つの引数しか許されません!
pt_br: Importante: os argumentos de configuração começando com a linha ``-vmargs`` devem ser as últimas linhas noarquivo ``eclipse.ini``, e é permitido apenas um argumento por linha.

source: If you do not see any SpotBugs problem markers (in your source windows or in the Problems View), you may need to change your ``Problems View`` filter settings. See `FAQ <faq.html#q6-the-eclipse-plugin-loads-but-doesn-t-work-correctly>`__ for more information.
ja: SpotBugs の問題マーカーが (ソースファイルや問題ビューに) 表示されないときは，``問題ビュー`` のフィルタ設定を変更する必要があります。詳細は `FAQ <faq.html#q6-the-eclipse-plugin-loads-but-doesn-t-work-correctly>`__ を参照してください。

source: If you do not see any SpotBugs problem markers (in your source windows or in the Problems View), you may need to change your ``Problems View`` filter settings. See :ref:`Q6 at FAQ <faq6>` for more information.
pt_br: Se você não vir nenhum marcador de problema do SpotBugs (em suas janelas de origem ouna Visualização de Problemas), você pode configurar os filtros da sua ``Visualização de Problemas``. Veja :ref:`Q6 at FAQ <faq6>` para mais informações.
