Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/effort.po
Languages: pt_br

source: Effort
pt_br: Esforço

source: Effort value adjusts internal flags of SpotBugs, to reduce computation cost by lowering the prediction.
pt_br: O valor do esforço ajusta os sinalizadores internos do SpotBugs, para reduzir o custo da computação por meio da redução de predição.

source: The default effort configuration is same with ``more``.
pt_br: A configuração de esforço default é a mesma com ``more``.

source: Flags in FindBugs.java
pt_br: Sinalizadores no FindBugs.java

source: Description
pt_br: Descrição

source: Effort Level
pt_br: Nível de esforço

source: Accurate Exceptions
pt_br: Exceções precisas

source: Determine (1) what exceptions can be thrown on exception edges, (2) which,catch blocks are reachable, and (3) which exception edges carry only, "implicit" runtime exceptions.
pt_br: Determina (1) quais exceções podem ser lançadas nas bordas da exceção, (2)quais blocos de captura são alcançáveis, e (3) quais bordas de exceção carregamapenas exceções de tempo de execução implícitas "implicit".

source: Model Instanceof
pt_br: Modelo Instanceof

source: Model the effect of instanceof checks in type analysis
pt_br: Modelar o efeito de verificações na análise de tipo instanceof

source: Track Guaranteed Value Derefs in Null Pointer Analysis
pt_br: Rastrear derefs de valor garantido na análise de ponteiro nulo

source: In the null pointer analysis, track null values that are guaranteed to be, dereferenced on some (non-implicit-exception) path.
pt_br: Na análise de ponteiro nulo, rastreia os valores nulos que têm garantia de ser não referenciado em algum caminho (exceção não implícita).

source: Track Value Numbers in Null Pointer Analysis
pt_br: Rastrear Números de Valor na Análise de Ponteiro Nulo

source: In the null pointer analysis, track value numbers that are known to be, null. This allows us to not lose track of null values that are not, currently in the stack frame but might be in a heap location where the, value is recoverable by redundant load elimination or forward, substitution.
pt_br: Na análise de ponteiro nulo, rastreia os números de valor que são conhecidos por serem null. Isso nos permite não perder o controle de valores nulos que não estão atualmente na pilha, mas podem estar em um local da heap onde o valor é recuperável por eliminação de carga redundante ou substituição direta.

source: Interprocedural Analysis
pt_br: Análise interprocedural

source: Enable interprocedural analysis for application classes.
pt_br: Habilitar análise interprocedural para classes de aplicação.

source: Interprocedural Analysis of Referenced Classes
pt_br: Análise interprocedural de classes referenciadas

source: Enable interprocedural analysis for referenced classes (non-application classes).
pt_br: Habilita a análise interprocedural para as classes referenciadas (não aplicado em classes).

source: Conserve Space
pt_br: Conservar espaço

source: Try to conserve space at the expense of precision. e.g. Prune unconditional exception thrower edges for control flow graph analysis, to reduce memory footprint.
pt_br: Tenta economizar espaço em detrimento da precisão. Por exemplo, poda as arestas de lançamento de exceção incondicional para análise de grafos de fluxo de controle, para reduzir o consumo de memória.

source: Skip Huge Methods
pt_br: Pula métodos grandes

source: Skip method analysis if length of its bytecode is too long (6,000).
pt_br: Pula a análise de métodos se o tamanho de seu bytecode é muito grande (6.000).
