Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ja, pt_br

source: This document contains answers to frequently asked questions about SpotBugs. If you just want general information about SpotBugs, have a look at the manual.
ja: このドキュメントには，SpotBugs に関する FAQ が含まれています。SpotBugs に関する一般的な情報だけが必要なときは，マニュアルをご覧ください。
pt_br: Este documento contém respostas para perguntas frequentes sobre o SpotBugs. Se você deseja apenas informações gerais sobre o SpotBugs, veja o manual.

source: Q1: I'm getting java.lang.UnsupportedClassVersionError when I try to run SpotBugs
ja: Q1: SpotBugs を実行しようとすると java.lang.UnsupportedClassVersionError が発生します。
pt_br: Q1: Estou recebendo java.lang.UnsupportedClassVersionError quando tento executar o SpotBugs

source: SpotBugs requires JRE8 or later to run. If you use an earlier version, you will see an exception error message similar to the following:
ja: SpotBugs を実行するためには JRE8 以降が必要です。以前のバージョンを使用しているときは，次のような例外エラーメッセージが表示されます。
pt_br: O SpotBugs requer JRE8 ou posterior para funcionar. Se você usar uma versão anterior, você verá uma mensagem de erro de exceção semelhante à seguinte:

source: The solution is to upgrade to JRE8 or later.
ja: 解決方法は，JRE8 以降にアップグレードすることです。
pt_br: A solução é atualizar para o JRE8 ou posterior.

source: Q2: SpotBugs is running out of memory, or is taking a long time to finish
ja: Q2: SpotBugs を実行するメモリが不足している，または終了するのに時間がかかる。
pt_br: Q2: O SpotBugs está ficando sem memória ou está demorando muito para terminar.

source: In general, SpotBugs requires lots of memory and a relatively fast CPU. For large applications, 1024M or more of heap space may be required.
ja: 一般的に，SpotBugs には多くのメモリと比較的高速な CPU が必要です。大規模なアプリケーションでは，1024M 以上のヒープ領域が必用になることがあります。
pt_br: Em geral, o SpotBugs requer muita memória e uma CPU relativamente rápida. Para aplicações grandes, pode ser necessário 1024MB ou mais de espaço de heap.

source: By default, SpotBugs allocates 768M of heap space. You can increase this using the ``-maxHeap n`` option, where n is the number of megabytes of heap space to allocate.
ja: デフォルトでは，SpotBugs は 768M のヒープ領域を割り当てます。``-maxHeap n`` オプションを使用してヒープ領域を増やせます。n は割り当てるヒープ領域のメガバイト数です。
pt_br: Por padrão, os SpotBugs aloca 768MB de espaço de heap. Você pode aumentar isso usando a opção ``-maxHeap n``, onde n é o número de megabytes de espaço de heap para alocar.

source: Q3: What is the "auxiliary classpath"? Why should I specify it?
ja: Q3: 「補助クラスパス」とは何ですか?なぜそれを指定すべきか?
pt_br: Q3: O que é o caminho de classe auxiliar "auxiliary classpath"? Por que devo especificar isso?

source: Many important facts about a Java class require information about the classes that it references. For example:
ja: Java クラスに関する重要な事実は，それが参照するクラスに関する情報を必要とします。たとえば:
pt_br: Muitos fatos importantes sobre uma classe Java requerem informações sobre as classes às quais faz referência. Por exemplo:

source: What other classes and interfaces the class inherits from
ja: クラスが継承する他のクラスとインタフェース
pt_br: De quais outras classes e interfaces a classe herda

source: What exceptions can be thrown by methods in external classes and interfaces
ja: 外部クラスとインタフェース内のメソッドによってスローされる例外
pt_br: Quais exceções podem ser lançadas por métodos em classes externas e interfaces

source: The "auxiliary classpath" is a list of Jar files, directories, and class files containing classes that are used by the code you want SpotBugs to analyze, but should not themselves be analyzed by SpotBugs.
ja: 「補助クラスパス」は，SpotBugs で解析するコードで使用されるクラスを含む Jar ファイル，ディレクトリ，クラスのリストですが，SpotBugs によって解析されるべきではありません。
pt_br: O caminho de classe auxiliar "auxiliary classpath" é uma lista de arquivos Jar, diretórios e arquivos de classe contendo classes que são usadas pelo código que você deseja executar a análise com o SpotBugs, mas que não devem ser analisadas por SpotBugs.

source: If SpotBugs doesn't have complete information about referenced classes, it will not be able to produce results that are as accurate as possible. For example, having a complete repository of referenced classes allows SpotBugs to prune control flow information so it can concentrate on paths through methods that are most likely to be feasible at runtime. Also, some bug detectors (such as the suspicious reference comparison detector) rely on being able to perform type inference, which requires complete type hierarchy information.
ja: SpotBugs に被参照クラスに関する完全な情報がない場合，可能なかぎり正確な結果を生成できません。たとえは，被参照クラスの完全なリポジトリを持つことで，SpotBugs は制御フロー情報を削減できるので，実行時に実現性が最も高いメソッドを通じてパスに集中できます。また，疑わしい参照比較ディテクタなどのバグディテクタの中には完全な型階層情報を必要とする型推論を実行できるものがあります。
pt_br: Se SpotBugs não tiver informações completas sobre as classes referenciadas, não será capaz de produzir resultados tão precisos. Por exemplo, ter um repositório completo de classes referenciadas permite que o SpotBugs remova as informações de fluxo de controle para que possa se concentrar nos caminhos por meio de métodos que são mais viáveis em tempo de execução. Além disso, alguns detectores de bug (como o detector de comparação de referência suspeita) confiam na capacidade de realização de inferência de tipo, o que requer uma informações completas da hierarquia de tipo.

source: For these reasons, we strongly recommend that you completely specify the auxiliary classpath when you run SpotBugs. You can do this by using the ``-auxclasspath`` command line option, or the "Classpath entries" list in the GUI project editor dialog.
ja: これらの理由から，SpotBugs の実行時に補助クラスパスを完全に指定することを強くお勧めします。``-auxclasspath`` コマンドラインオプション，または GUI プロジェクトエディタダイアログの "Classpath entries" リストを使って設定できます。
pt_br: Por esses motivos, é altamente recomendável que você especifique completamente o classpath auxiliar ao executar o SpotBugs. Você pode fazer isso usando a opção de linha de comando ``-auxclasspath`` ou a lista na caixa de diálogo GUI em "Classpath entries".

source: If SpotBugs cannot find a class referenced by your application, it will print out a message when the analysis completes, specifying the classes that were missing. You should modify the auxiliary classpath to specify how to find the missing classes, and then run SpotBugs again.
ja: SpotBugs がアプリケーションによって参照されるクラスを見つけられない場合，SpotBugs は解析が完了したときに見つからなかったクラスを指定してメッセージを出力します。補助クラスパスを変更して見つからなかったクラスを見つける方法を指定し，SpotBugs を再度実行する必要があります。
pt_br: Se o SpotBugs não conseguir encontrar uma classe referenciada por seu aplicativo, ele irá imprimir uma mensagem quando a análise for concluída, especificando as classes que estavam faltando. Você deve modificar o caminho de classe auxiliar para especificar como encontrar as classes que faltam e, em seguida, executar o SpotBugs novamente.

source: Q4: The Eclipse plugin doesn't load
ja: Q4: Eclipse プラグインがロードされない
pt_br: Q4: O plugin do eclipse não carrega

source: The symptom of this problem is that Eclipse fails to load the SpotBugs UI plugin with the message:
ja: この問題の症状は，次のようなメッセージで Eclipse が SpotBugs UI プラグインをロードできないことです。
pt_br: Quando o Eclipse não consegue carregar a interface do plugin do SpotBugs apresenta a mensagem:

source: The reason for this problem is that the Eclipse plugin distributed with SpotBugs does not work with older 3.x versions of Eclipse. Please use Eclipse Neon (version 4.6) or newer.
ja: この問題の原因は，SpotBugs で配布されている Eclipse プラグインが Eclipse の古い 3.x バージョンでは動作しないためです。Eclipse Neon (バージョン 4.6) 以降を使用してください。
pt_br: A razão para este problema é que o plugin do SpotBugs não funciona com versões 3.x ou mais antigas do Eclipse. Use o Eclipse Neon (versão 4.6) ou mais recente.

source: Q5: I'm getting a lot of false "OS" and "ODR" warnings
ja: Q5: 多くの誤った "OS" と "ODR" 警告を受けています。
pt_br: Q5: Eu estou obtendo muitos avisos falsos para "OS" e "ODR"

source: By default, SpotBugs assumes that any method invocation can throw an unchecked runtime exception. As a result, it may assume that an unchecked exception thrown out of the method could bypass a call to a ``close()`` method for a stream or database resource.
ja: デフォルトでは，SpotBugs はメソッド呼び出しが非検査例外をスローする可能性があるとみなします。その結果，メソッドからスローされた非検査例外が，ストリームまたはデータベースリソースの ``close()`` メソッドへの呼び出しをバイパスできたと仮定するかもしれません。
pt_br: Por padrão, o SpotBugs assume que qualquer invocação de método pode lançar uma exceção de tempo de execução não verificada. Como resultado, pode assumir que uma exceção lançada para fora do método pode ignorar uma chamada a um método ``close ()`` para um fluxo ou recurso de banco de dados.

source: You can use the ``-workHard`` command line argument or the ``findbugs.workHard`` boolean analysis property to make SpotBugs work harder to prune unlikely exception edges. This generally reduces the number of false warnings, at the expense of slowing down the analysis.
ja: ``-workHard`` コマンドライン引数や ``findbugs.workHard`` ブール解析プロパティを使用して SpotBugs を動作させて，例外ではないエッジを削減できます。ほとんどの場合，誤った警告の数を減らせますが，解析を遅くするという犠牲を払います。
pt_br: Você pode usar o argumento da linha de comando ``-workHard`` ou a propriedade de análise booleana ``findbugs.workHard`` para fazer o SpotBugs podar mais bordas de exceção improváveis. Isso geralmente reduz o número de avisos falsos, as custas do aumento do tempo de análise.

source: Q6: The Eclipse plugin loads, but doesn't work correctly
ja: Q6: Eclipse プラグインはロードされるが，正しく動作しません
pt_br: Q6: O plugin do Eclipse carrega, mas não funciona corretamente

source: Make sure the Java code you trying to analyze is built properly and has no classpath or compile errors.
ja: 解析しようしとている Java コードが正しく構築され，クラスパスやコンパイルエラーがないことを確認してください。
pt_br: verifique que o código Java que você está tentando analisar está construído e não possui caminhos de classes ou erros de compilação.

source: Make sure the project and workspace SpotBugs settings are valid - in doubt, revert them to defaults.
ja: プロジェクトとワークスペースの SpotBugs 設定が有効であることを確認します。疑わしいときはデフォルトに戻してください。
pt_br: verifique se as configurações do SpotBugs para o projeto e workspace são válidas. Em caso de dúvidas, reverta as configurações para default.

source: Make sure the Error log view does not show errors.
ja: エラーログビューにエラーが表示されていないことを確認します。
pt_br: Verifique se o log de erros não apresenta erros.

source: Q7: Where is the Maven plugin for SpotBugs?
ja: Q7: SpotBugs の Maven プラグインはどこにありますか?
pt_br: Q7: Onde está o plugin maven para o SpotBugs?

source: The Maven Plugin for SpotBugs may be found `here <https://github.com/gleclaire/findbugs-maven-plugin/>`_. Please note that the Maven plugin is not maintained by the SpotBugs developers, so we can't answer questions about it.
ja: SpotBugs の Maven プラグインは `ここ <https://github.com/gleclaire/findbugs-maven-plugin/>`_ にあります。Maven プラグインは，SpotBugs の開発者によって管理されていないので，私たちは質問に答えられません。

source: The Maven Plugin for SpotBugs may be found `here <https://github.com/spotbugs/spotbugs-maven-plugin/>`_.
pt_br: o plugin maven para o Spotbugs pode ser encontrado `aqui <https://github.com/spotbugs/spotbugs-maven-plugin/>`_.
