Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/filter.po
Languages: ja, pt_br

source: This element matches warnings having at least a specified bug rank. The ``value`` attribute should be an integer value between 1 and 20, where 1 to 4 are scariest, 5 to 9 scary, 10 to 14 troubling, and 15 to 20 of concern bugs.
pt_br: Este elemento corresponde os avisos com a classificação de bug especificada. O atributo ``value`` deve ser um valor inteiro entre 1 e 20, onde os valores de 1 a 4 indicam os bugs mais graves, de 5 a 9 os bugs graves, de 10 a 14 os bugs problemáticos e de 15 a 20 os bugs preocupantes.
