Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/filter.po
Languages: ja, pt_br

source: Filter file
ja: フィルタファイル
pt_br: Arquivos de filtro

source: Filter files may be used to include or exclude bug reports for particular classes and methods. This chapter explains how to use filter files.
ja: フィルタファイルを使用して，特定のクラスやメソッドのバグレポートに含めたり除外したりできます。この章では，フィルタファイルの使用方法について説明します。
pt_br: Arquivos de filtro podem ser usados para incluir ou excluir o reporte de bugs para classes e métodos específicos. Este capítulo explica como usar os arquivos de filtro.

source: Introduction to Filter Files
ja: フィルタファイルの概要
pt_br: Introdução aos arquivos de filtro

source: Conceptually, a filter matches bug instances against a set of criteria. By defining a filter, you can select bug instances for special treatment; for example, to exclude or include them in a report.
ja: 概念的には，フィルタはバグインスタンスを基準のセットと照合します。フィルタを定義することで，特別扱いのバグインスタンスを選択できます。たとえば，レポートに含めたり除外したりできます。
pt_br: Conceitualmente, um filtro compara instâncias de bug com um conjunto de critérios. Ao definir um filtro, você pode selecionar um tratamento especial para instâncias de bugs, como excluí-las ou incluí-las em um reporte.

source: A filter file is an XML document with a top-level ``FindBugsFilter`` element which has some number of Match elements as children. Each Match element represents a predicate which is applied to generated bug instances. Usually, a filter will be used to exclude bug instances. For example::
ja: フィルタファイルは，最上位の ``FindBugsFilter`` 要素を持つ XML 文書で，いくつかの ``Match`` 要素が子要素として含まれています。それぞれの ``Match`` 要素は，生成されたバグインスタンスに適用される述語を表します。通常，バグインスタンスを除外するためにフィルタが使用されます。たとえば::
pt_br: Um arquivo de filtro é um documento XML com o elemento de nível superior ``FindBugsFilter``, que possui um número de elementos Match como filhos. Cada elemento Match representa uma premissa a ser aplicada na geração de instâncias de bug. Geralmente, um filtro é usado para excluir instâncias de bug. Por exemplo::

source: However, a filter could also be used to select bug instances to specifically report::
ja: また一方で，具体的に報告するバグインスタンスを選択するためにフィルタを使用することもできます。
pt_br: No entanto, um filtro também pode ser usado para selecionar instâncias de bug para um reporte específico::

source: ``Match`` elements contain children, which are conjuncts of the predicate. In other words, each of the children must be ``true`` for the predicate to be ``true``.
ja: ``Match`` 要素には，述語を結合した子要素が含まれます。言い換えれば，述語が ``真`` であるためには，それぞれの子要素も ``真`` でなければなりません。
pt_br: Os filhos dos elementos ``Match`` são conjuntos de premissas. Em outras palavras, cada filho deve ser verdadeiro ``true``para que a premissa seja verdadeira ``true``.

source: Types of Match clauses
ja: マッチング条件の種類
pt_br: Tipos de cláusulas Match

source: This element specifies a particular bug ``pattern`` or ``patterns`` to match. The ``pattern`` attribute is a comma-separated list of bug pattern types. You can find the bug pattern types for particular warnings by looking at the output produced by the **-xml** output option (the type attribute of BugInstance elements), or from the :doc:`bugDescriptions`.
ja: この要素は，特定のバグパターンまたは一致するパターンを指定します。``pattern`` 属性は，コンマ区切りのバグパターンタイプのリストです。特定の警告のバグパターンタイプは **-xml** 出力オプション (BugInstance 要素の type 属性) によって生成された出力を調べることで見つけられます。または，:doc:`bugDescriptions` を参照してください。
pt_br: Este elemento especifica um ou mais padrões (``pattern`` ou ``patterns``) de um bug a serem comparados. O atributo ``pattern`` é uma lista, separada por vírgulas, contendo os tipos de padrões de bug. Você pode encontrar os tipos de padrões de bug ao procurar avisos específicos na saída produzida pela opção **-xml** (o atributo type do elemento BugInstances) ou a partir da :doc:`bugDescriptions`.

source: For more coarse-grained matching, use ``code`` attribute. It takes a comma-separated list of bug abbreviations. For most-coarse grained matching use ``category`` attribute, that takes a comma separated list of bug category names: ``CORRECTNESS``, ``MT_CORRECTNESS``, ``BAD_PRACTICICE``, ``PERFORMANCE``, ``STYLE``.
ja: もっと粒度の粗い照合をしたいときは，``code`` 属性を使用します。コンマ区切りのバグ略語のリストを指定します。粒度の粗い照合では，``category`` 属性を使用してコンマ区切りのバグカテゴリのリストを指定します。バグカテゴリ名は，``CORRECTNESS``，``MT_CORRECTNESS``，``BAD_PRACTICICE``，``PERFORMANCE``，``STYLE`` です。
pt_br: Para uma comparação granulosa, use o atributo ``code``. É necessária uma lista, separada por vírgulas, contendo as abreviações de bug. Para uma comparação mais granulosa, use o atributo ``category``. Para isso, é necessária uma lista, separadas por vírgulas, com os nomes das categorias de bug: ``CORRECTNESS``, ``MT_CORRECTNESS``, ``BAD_PRACTICICE``, ``PERFORMANCE``, ``STYLE``.

source: If more than one of the attributes mentioned above are specified on the same <Bug> element, all bug patterns that match either one of specified pattern names, or abbreviations, or categories will be matched.
ja: 同じ <Bug> 要素に上記の属性が複数指定されていたときは，指定されたパターン名，略語，カテゴリのいずれかと一致するすべてのバグパターンが一致します。
pt_br: Se mais de um dos atributos mencionados acima forem especificados no mesmo elemento <Bug>, todos os padrões de bug que correspondem a um dos nomes de padrão, abreviações ou categorias, serão correspondidos.

source: As a backwards compatibility measure, <BugPattern> and <BugCode> elements may be used instead of <Bug> element. Each of these uses a name attribute for specifying accepted values list. Support for these elements may be removed in a future release.
ja: 下位互換性のために，<Bug> 要素の代わりに <BugPattern> と <BugCode> 要素を使用できます。それぞれの要素は，受け入れられた値のリストを指定するための ``name`` 属性を使用します。 これらの要素のサポートは，将来のリリースで削除される可能性があります。
pt_br: Como medida de compatibilidade com versões anteriores, os elementos <BugPattern> e <BugCode> podem ser usados em vez do elemento <Bug>. Cada um deles usa o atributo nome para especificar a lista de valores aceitos. O suporte para esses elementos pode ser removido em uma versão futura.

source: This element matches warnings with a particular bug confidence. The ``value`` attribute should be an integer value: 1 to match high-confidence warnings, 2 to match normal-confidence warnings, or 3 to match low-confidence warnings. ``<Confidence>`` replaced ``<Priority>`` in 2.0.0 release.
ja: この要素は，警告を特定のバグ信頼度と照合します。``value`` 属性は，整数値でなければなりません。1 は信頼度 (High)，2 は信頼度 (Medium)，3 は信頼度 (Low) の警告と一致します。2.0.0 リリースで，``<Confidence>`` は ``<Priority>`` に換えられました。
pt_br: Este elemento corresponde os avisos de bug com os níveis de confiança. O atributo ``value`` deve ser um valor inteiro: 1 corresponde ao nível de confiança alta , 2 corresponde ao nível de confiança normal e 3 corresponde ao nível de confiança baixa.O elemento ``<Confidence>`` substituiu o atributo ``<Priority>`` na versão 2.0.0.

source: Same as ``<Confidence>``, exists for backward compatibility.
ja: ``<Confidence>`` と同じです。下位互換性を保つために残されています。
pt_br: Equivalente ao elemento ``<Confidence>``. Existe por motivos de compatibilidade com versões anteriores.

source: This element matches warnings with a particular bug rank. The ``value`` attribute should be an integer value between 1 and 20, where 1 to 4 are scariest, 5 to 9 scary, 10 to 14 troubling, and 15 to 20 of concern bugs.
ja: この要素は，警告を特定のバグランクと照合します。``value`` 属性は，1 から 20 までの整数値でなければなりません。1 から 4 は恐るべきバグ， 5 から 9 は恐ろしいバグ， 10 から 14 は厄介なバグ， 15 から 20 は心配なバグを表します。

source: This element matches warnings associated with classes within the package specified using ``name`` attribute. Nested packages are not included (along the lines of Java import statement). However matching multiple packages can be achieved easily using regex name match.
ja: この要素は，``name`` 属性で指定されたパッケージ内のクラスに関連した警告と照合します。ネストしたパッケージは含まれていません (Java import 文に従っています)。しかし，正規表現を使用すると複数のパッケージに一致させることが簡単に実現できます。
pt_br: Este elemento corresponde os avisos com as classes dentro do pacote especificado utilizando o atributo ``name``. Os pacotes aninhados não são incluídos (em conjunto com as linhas de importação Java). No entanto, a correspondência de vários pacotes pode ser alcançada facilmente usando regex para a correspondência de nomes.

source: This element matches warnings associated with a particular class. The ``name`` attribute is used to specify the exact or regex match pattern for the class name. The ``role`` attribute is the class role.
ja: この要素は，特定のクラスに関連した警告と照合します。``name`` 属性は，クラス名の正確な正規表現パターンを指定するために使用されます。``role`` 属性はクラスの役割です。
pt_br: Este elemento corresponde os avisos associados com uma classe específica. O atributo ``name`` é usado para especificar o padrão de correspondência exato ou regex para o nome da classe. O atributo ``role`` é o papel da classe.

source: As a backward compatibility measure, instead of element of this type, you can use ``class`` attribute on a ``Match`` element to specify exact an class name or ``classregex`` attribute to specify a regular expression to match the class name against.
ja: 下位互換性のために，<Class> 要素の代わりに ``Match`` 要素の ``class`` 属性を使用して厳密なクラス名を指定できます。また， ``classregex`` 属性を使用してクラス名と一致する正規表現を指定することもできます。
pt_br: Como medida de compatibilidade com versões anteriores, você pode usar o atributo ``class`` em um elemento ``Match`` para especificar o nome exato de uma classe ou o atributo ``classregex`` para especificar uma expressão regular para a correspondência com o nome da classe.

source: If the ``Match`` element contains neither a ``Class`` element, nor a ``class`` / ``classregex`` attribute, the predicate will apply to all classes. Such predicate is likely to match more bug instances than you want, unless it is refined further down with appropriate method or field predicates.
ja: ``Match`` 要素に ``Class`` 要素も ``class`` / ``classregex`` 属性も含まれていないときは，述語は全てのクラスに適用されます。そのような述語は適切なメソッドやフィールド述語を使用してさらに細かく分類されないかぎり，必要以上のバグインスタンスに一致する可能性があります。
pt_br: Se o elemento ``Match`` não contém um elemento ``Class``, nem um atributo ``class`` / ``classregex``, então a premissa será aplicada a todas as classes. Tal premissa pode identificar mais instâncias de bug do que você deseja, a menos que seja refinado ainda mais com o método apropriado ou premissas de campo.

source: This element matches warnings associated with a particular source file. The ``name`` attribute is used to specify the exact or regex match pattern for the source file name.
ja: この要素は，特定のソースファイルに関連した警告と照合します。``name`` 属性は，ソースファイル名の正確な正規表現パターンを指定するために使用されます。
pt_br: Este elemento corresponde os avisos com um arquivo de origem específico. O atributo ``name`` é usado para especificar o padrão de correspondência exata ou regex para o nome do arquivo de origem.

source: This element specifies a method. The ``name`` attribute is used to specify the exact or regex match pattern for the method name. The ``params`` attribute is a comma-separated list of the types of the method's parameters. The ``returns`` attribute is the method's return type. The ``role`` attribute is the method role. In ``params`` and ``returns``, class names must be fully qualified. (E.g., ``"java.lang.String"`` instead of just ``"String"``.) If one of the latter attributes is specified the other is required for creating a method signature. Note that you can provide either ``name`` attribute or ``params`` and ``returns`` attributes or all three of them. This way you can provide various kinds of name and signature based matches.
ja: この要素は，メソッドを指定します。``name`` 属性は，メソッド名の正確な正規表現パターンを指定するために使用されます。``params`` 属性は，メソッドパラメータの型のコンマ区切りリストです。``returns`` 属性は，メソッドの戻り値の型です。``role`` 属性は，メソッドの役割です。``params`` と ``returns`` はクラスの完全修飾名でなければなりません。(たとえば ``"String"`` ではなく ``"java.lang.String"`` を使用します。) 後者の属性のいずれかが指定されているときは，もう一方がメソッドシグネチャを作成するために必要です。``name`` 属性，``params`` と ``returns`` 属性，あるいはすべての属性を指定できます。このように，さまざまな種類の名前とシグネチャに基づく照合条件を指定できます。
pt_br: Este elemento especifica um método. O atributo ``name`` é usado para especificar o padrão de correspondência exata ou regex para o nome do método. O atributo ``params`` é uma lista contendo os tipos de parâmetros do método separados por vírgulas. O atributo ``returns`` é o tipo de retorno do método. O atributo ``role`` é o papel do método. Em ``params`` e ``returns``, os nomes das classes devem ser totalmente qualificados. (Por exemplo: ``"java.lang.String"`` instead of just ``"String"``.) Se um dos últimos atributos for especificado, o outro é necessário para criar a assinatura de método. Observe que você pode fornecer o atributo ``name``, ``params`` e ``returns``, ou todos os três. Dessa forma, você pode fornecer vários tipos de correspondências baseadas em nome e assinatura.

source: This element specifies a field. The ``name`` attribute is used to specify the exact or regex match pattern for the field name. You can also filter fields according to their signature - use ``type`` attribute to specify fully qualified type of the field. You can specify either or both of these attributes in order to perform name / signature based matches. The ``role`` attribute is the field role.
ja: この要素は，フィールドを指定します。``name`` 属性は，フィールド名の正確な正規表現パターンを指定するために使用されます。シグネチャに基づいてフィールドをフィルタリングすることもできます。フィールドの完全修飾型を指定するためには ``type`` 属性を使用します。名前やシグネチャに基づいた照合を実行するために，これらの属性の一方または両方を指定できます。``role`` 属性はフィールドの役割です。
pt_br: Este elemento especifica um campo. O atributo ``name`` é usado para especificar o padrão de correspondência exata ou regex para o nome do campo. Você também pode filtrar os campos de acordo com sua assinatura - use o atributo ``type`` para especificar o tipo do campo qualificado. Você pode especificar um ou ambos os atributos para realizar correspondências baseadas em nome / assinatura. O atributo ``role`` é o papel do campo.

source: This element specifies a local variable. The ``name`` attribute is used to specify the exact or regex match pattern for the local variable name. Local variables are variables defined within a method.
ja: この要素は，ローカル変数を指定します。``name`` 属性は，ローカル変数名の正確な正規表現パターンを指定するために使用されます。ローカル変数は，メソッド内で定義される変数です。
pt_br: Este elemento especifica uma variável local. O atributo ``name`` é usado para especificar o padrão de correspondência exata ou regex para o nome da variável local. Variáveis locais são variáveis definidas dentro de um método.

source: This element matches warnings associated with a particular type. The ``descriptor`` attribute is used to specify the exact or regex match pattern for type descriptor. If the descriptor starts with the ~ character the rest of attribute content is interpreted as a Java regular expression. The ``role`` attribute is the class role, and the ``typeParameters`` is the type parameters. Both of ``role`` and ``typeParameters`` are optional attributes.
ja: この要素は，特定の型に関連した警告と照合します。``descriptor`` 属性は，型修飾子の正確な正規表現パターンを指定するために使用されます。ディスクリプタが ~ 文字で始まるときは，残りの属性コンテンツはJavaの正規表現として解釈されます。``role`` 属性は，クラスの役割です。``typeParameters`` 属性は，型パラメータです。``role`` と ``typeParameters`` はオプション属性です。
pt_br: Este elemento corresponde os avisos com um tipo específico. O atributo ``descriptor`` é usado para especificar o padrão de correspondência exata ou regex para o descritor de tipo. Se o descritor começar com o caractere ~, o resto do conteúdo do atributo é interpretado como uma expressão Java regular. O atributo ``role`` é o papel da classe, e o ``typeParameters`` são os tipos de parâmetro. Ambos de ``role`` e ``typeParameters`` são atributos opcionais.

source: This element combines ``Match`` clauses as disjuncts. I.e., you can put two ``Method`` elements in an ``Or`` clause in order to match either method.
ja: この要素は，マッチング条件を論理和として組み合わせます。つまり，いずれかのメソッドと照合させるために 2 つの ``Method`` 要素を ``Or`` 要素に入れられます。
pt_br: Este elemento combina cláusulas ``Match`` como disjuntas. Isto é, você pode colocar dois elementos ``Method`` em uma cláusula ``Or`` para identificar qualquer um dos métodos.

source: This element combines ``Match`` clauses which both must evaluate to ``true``. I.e., you can put ``Bug`` and ``Confidence`` elements in an ``And`` clause in order to match specific bugs with given confidence only.
ja: この要素は，マッチング条件を論理積として組み合わせます。つまり，特定のバグに与えられた信頼度だけと照合させるために ``Bug`` 要素と ``Confidence`` 要素を ``And`` 要素に入れられます。
pt_br: Este elemento combina cláusulas ``Match`` que devem ser avaliadas como verdadeiras ``true``. Isto é, você pode colocar os elementos ``Bug`` e ``Confidence`` em uma cláusula ``And`` para identificar as instâncias de bug apenas com o nível de confiança estabelecido.

source: This element inverts the included child ``Match``. I.e., you can put a ``Bug`` element in a ``Not`` clause in order to match any bug excluding the given one.
ja: この要素は，含まれている子要素の ``Match`` を反転させます。つまり，与えられたバグ以外のバグと照合させるために ``Bug`` 要素を ``Not`` 要素に入れられます。
pt_br: Este elemento inverte os filhos incluídos em ``Match``. Isto é, você pode colocar um elemento ``Bug`` em uma cláusula ``Not`` para identificar quaisquer instâncias de bus, com exceção da especificada na cláusula.

source: Java element name matching
ja: Java 要素名との一致
pt_br: Correspondência entre nomes de elementos Java

source: If the ``name`` attribute of ``Class``, ``Source``, ``Method`` or ``Field`` starts with the ``~`` character the rest of attribute content is interpreted as a Java regular expression that is matched against the names of the Java element in question.
ja: ``Class``，``Source``，``Method``，``Field`` の ``name`` 属性が ~ 文字で始まるときは，残りの属性コンテンツはJava要素名と照合されるJavaの正規表現として解釈されます。
pt_br: Se o atributo ``name`` dos elementos ``Class``, ``Source``, ``Method`` or ``Field`` começar com o caracter ``~``, então o restante do conteúdo do atributo é interpretado com uma expressão Java regular que é comparada com os nomes dos elementos Java em questão.

source: Note that the pattern is matched against whole element name and therefore ``.*`` clauses need to be used at pattern beginning and/or end to perform substring matching.
ja: パターンは，要素名全体と照合されるので，部分文字列で照合をしたいときは，パターンの先頭や最後に ``.*`` を使用する必要があることに注意してください。
pt_br: Veja que o padrão é comparado com o nome completo do elemento e, portanto, as cláusulas precisam ser iniciadas e/ou terminadas em ``.*`` para realizar a identificação de substrings.

source: See `java.util.regex.Pattern <https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html>`_ documentation for pattern syntax.
ja: パターン構文については `java.util.regex.Pattern <https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html>`_ を参照してください。
pt_br: Veja a documentação `java.util.regex.Pattern <https://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html>`_ para sintaxe de padrão.

source: Caveats
ja: 注意事項

source: ``Match`` clauses can only match information that is actually contained in the bug instances. Every bug instance has a class, so in general, excluding bugs by class will work.
ja: ``Match`` 節は実際にバグインスタンスに含まれている情報にしかマッチできません。すべてのバグインスタンスにはクラスがあるので，一般的にクラスによるバグの除外はうまくいきます。
pt_br: As cláusulas ``Match`` podem comparar apenas as informações que realmente estão contidas nas instâncias de bug. Cada instância de bug possui uma classe, então a exclusão de bugs por classes funcionará.

source: Some bug instances have two (or more) classes. For example, the DE (dropped exception) bugs report both the class containing the method where the dropped exception happens, and the class which represents the type of the dropped exception. Only the *first* (primary) class is matched against ``Match`` clauses. So, for example, if you want to suppress IC (initialization circularity) reports for classes "com.foobar.A" and "com.foobar.B", you would use two ``Match`` clauses:
ja: いくつかのバグインスタンスは 2 つか，それ以上のクラスを持っています。たとえば，DE (無視された例外) バグは，無視された例外が発生するメソッドを含むクラスと無視された例外の型を表すクラスの両方を報告します。*一番目* (主) のクラスだけがマッチング条件とマッチします。たとえば，クラス 「com.foobar.A」と「com.foobar.B」の IC (初期化時の循環) レポートを抑制したいときは，2 つの ``Match`` 要素を使用してマッチング条件を指定します。
pt_br: Algumas instâncias de bug têm duas (ou mais) classes. Por exemplo, os bugs DE (dropped exception) reportam a classe que contém o método onde o dropped exception acontece e a classe que representa o tipo dropped exception. Somente a *primeira* classe (primária) é comparada com as cláusulas ``Match``. Então, por exemplo, se você deseja suprimir os relatórios de IC (initialization circularity) para as classes ""com.foobar.A" e "com.foobar.B", você usaria duas cláusulas ``Match``:

source: By explicitly matching both classes, you ensure that the IC bug instance will be matched regardless of which class involved in the circularity happens to be listed first in the bug instance. (Of course, this approach might accidentally suppress circularities involving "com.foobar.A" or "com.foobar.B" and a third class.)
ja: 両方のクラスを明示的に照合することで，循環に関与しているクラスがバグインスタンスで最初にリストされたとしても IC バグインスタンスがマッチすることを保証します。(もちろん，このアプローチでは，「com.foobar.A」または「com.foobar.B」と第 3 のクラスを含む循環が誤って抑制される可能性があります。)
pt_br: Ao corresponder explicitamente as duas classes, você garante que a instância do bug IC será correspondida, independentemente de qual classe envolvida na circularidade seja listada primeiro na instância do bug. (Claro, esta abordagem pode suprimir acidentalmente circularidades envolvendo "com.foobar.A" ou "com.foobar.B" e uma terceira classe.)

source: Many kinds of bugs report what method they occur in. For those bug instances, you can put Method clauses in the Match element and they should work as expected.
ja: さまざまな種類のバグは，どのようなメソッドで発生するかを報告します。これらのバグインスタンスに対しては，``Method`` 節を ``Match`` 要素に入れられるので，期待どおりに動作するはずです。
pt_br: Muitos tipos de bug relatam o método em que ocorrem. Para essas instâncias de bug, você pode colocar cláusulas Method no elemento Match e eles devem funcionar conforme o esperado.

source: Examples
ja: 例
pt_br: Exemplos

source: Match all bug reports for a class
ja: 特定のクラスに対するすべてのバグレポートと一致させる
pt_br: Identificação de todos os bugs em uma classe

source: Match certain tests from a class by specifying their abbreviations
ja: 略語を指定してクラスから特定のテストと一致させる
pt_br: Identificação de certos testes de uma classe por meio da especificação de suas abreviações

source: Match certain tests from all classes by specifying their abbreviations
ja: 略語を指定して，全てのクラスの特定のテストと一致させる
pt_br: Identificação de certos testes de todas as classes por meio da especificação de suas abreviações

source: Match certain tests from all classes by specifying their category
ja: カテゴリを指定して，全てのクラスの特定のテストと一致させる
pt_br: Identificação de certos testes de todas as classes por meio da especificação de sua categoria

source: Match bug types from specified methods of a class by their abbreviations
ja: クラスのメソッドの略称を指定して，バグタイプと一致させる
pt_br: Identificação de tipos de bug de métodos especificados de uma classe por meio de suas abreviações

source: Match a particular bug pattern in a particular method
ja: 特定のメソッドで特定のバグパターンと一致させる
pt_br: Identificação de um padrão de bug em um método específico

source: Match a particular bug pattern with a given priority in a particular method
ja: 特定のメソッドで特定のバグパターンと優先度で一致させる
pt_br: Identificação de um padrão de bug com prioridade em um método específico

source: Match minor bugs introduced by AspectJ compiler (you are probably not interested in these unless you are an AspectJ developer)
ja: AspectJ コンパイラによって導入されたマイナーなバグに一致させる (AspectJ 開発者でないかぎり，おそらく関心がない)
pt_br: Identificação de minor bugs introduzidos pelo compilador do AspectJ (você provavelmente não está interessado nessa parte, a menos que seja um desenvolvedor Aspectj

source: Match bugs in specific parts of the code base
ja: コードベースの特定の部分と一致させる
pt_br: Identificação de bugs em partes específicas do código base

source: Match bugs on fields or methods with specific signatures
ja: 特定のシグネチャを持つフィールドやメソッドのバグに一致させる
pt_br: Identificação de bugs em campos e métodos com assinaturas específicas

source: Match bugs using the Not filter operator
ja: Not フィルタ演算子を使用してバグと一致させる
pt_br: Identificação de bugs usando o operador de filtro Not

source: Full exclusion filter file to match all classes generated from Groovy source files
ja: Groovy ソースファイルから生成されたすべてのクラスに一致する完全除外フィルタファイル
pt_br: Arquivo de filtro de exclusão completo para identificação de todas as classes geradas a partir de arquivos do Groovy

source: Complete Example
ja: 完全な例
pt_br: Exemplo completo
