Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/gradle.po
Languages: ja, pt_br

source: Using the SpotBugs Gradle Plugin
ja: SpotBugs Gradle プラグインの使い方
pt_br: Usando o SpotBugs Gradle Plugin

source: This chapter describes how to integrate SpotBugs into a build script for Gradle.
ja: この章では，Gradle のビルドスクリプトに SpotBugs を統合する方法について説明します。
pt_br: Este capítulo descreve como integrar o Spotbugs em um script de construção Gradle.

source: Use SpotBugs Gradle Plugin
ja: SpotBugs Gradle プラグインを使う
pt_br: Uso do SpotBugs Gradle Plugin

source: Please follow instruction found on `official Gradle Plugin page <https://plugins.gradle.org/plugin/com.github.spotbugs>`_.
ja: `Gradle プラグインの公式ページ <https://plugins.gradle.org/plugin/com.github.spotbugs>`_ の指示に従ってください。
pt_br: Por favor, siga as instruções encontradas na `página oficial do Gradle Plugin <https://plugins.gradle.org/plugin/com.github.spotbugs>`_.

source: Note that SpotBugs Gradle Plugin does not support Gradle v4, you need to use v5.1 or later.
ja: SpotBugs PluginはGradleバージョン4をサポートしません。バージョン5.1以降を使用してください。

source: Tasks introduced by this Gradle Plugin
ja: Gradle プラグインによって導入されたタスク
pt_br: Tarefas introduzidas pelo Gradle Plugin

source: This Gradle Plugin introduces two tasks: `spotbugsMain` and `spotbugsTest`.
ja: Gradle プラグインには，`spotbugsMain` と `spotbugsTest` という2つのタスクが導入されています。

source: `spotbugsMain` task runs SpotBugs for your production Java source files. This task depends on `classes` task. `spotbugsTest` task runs SpotBugs for your test Java source files. This task depends on `testClasses` task.
ja: `spotbugsMain` タスクは，製品 Java ソースファイル用の SpotBugs を実行します。このタスクは `classes` タスクに依存します。`spotbugsTest` タスクは，テスト Java ソースファイル用の SpotBugs を実行します。このタスクは `testClasses` タスクに依存します。

source: SpotBugs Gradle Plugin adds task dependency from `check` to these tasks, so you can simply run ``./gradlew check`` to run SpotBugs.
ja: SpotBugs Gradle プラグインは，`check` タスクからこれらのタスクにタスク依存関係を追加するので，単に ``./gradlew check`` を実行すれば SpotBugs を実行できます。

source: Configure Gradle Plugin
ja: Gradle プラグインの設定
pt_br: Configuração do Gradle Plugin

source: Current version of SpotBugs Gradle Plugin uses the same way with FindBugs Gradle Plugin to configure. Please check the document for `FindBugsExtension <http://gradle.monochromeroad.com/docs/dsl/org.gradle.api.plugins.quality.FindBugsExtension.html>`_.
ja: 現バージョンの SpotBugs Gradle プラグインは FindBugs Gradle プラグインと同じ方法で設定します。`FindBugsExtension <http://gradle.monochromeroad.com/docs/dsl/org.gradle.api.plugins.quality.FindBugsExtension.html>`_ のドキュメントを参照してください。

source: For instance, to specify the version of SpotBugs, you can configure like below:
ja: たとえば，SpotBugs のバージョンを指定したいときは，次のように設定します。
pt_br: Por exemplo, para especificar a versão do SpotBugs, você pode configurar da seguinte forma:

source: Introduce SpotBugs Plugin
ja: SpotBugs Pluginを利用する
pt_br: Introdução ao SpotBugs Plugin

source: To introduce SpotBugs Plugin, please declare dependency in ``dependencies`` like below:
ja: SpotBugs Pluginを利用するには，プラグインへの依存を次のように ``dependencies`` 内に記載してください:
pt_br: Para introduzir o SpotBugs Plugin, por favor declare a dependência em ``dependencies`` como mostrado a seguir:

source: Generate SpotBugs Tasks with Android Gradle Plugin
ja: Android Gradle プラグインで SpotBugs タスクを生成する

source: SpotBugs Gradle Plugin generates task for each sourceSet. But Android Gradle Plugin does not generate sourceSet by default (Java plugin does).
ja: SpotBugs Gradle プラグインは，sourceSet ごとにタスクを生成します。しかし，Android Gradle プラグインは，デフォルトでは sourceSet を生成しません (Java プラグインでは)。

source: So define sourceSets explicitly, then SpotBugs Gradle plugin generates tasks for each of them.
ja: sourceSet を明示的に定義すると，SpotBugs Gradle プラグインは sourceSet ごとにタスクを生成します。

source: Note that SpotBugs Gradle Plugin does not support Gradle v4, you need to use v5.6 or later.
pt_br: Observe que o SpotBugs Gradle Plugin não suporta o Gradle v4, você precisa usar a v5.6 ou superior.

source: This Gradle Plugin generates task for each sourceSet generated by Gradle Java Plugin. For instance, if you have two sourceSets `main` and `test`, this plugin will generates two tasks: `spotbugsMain` and `spotbugsTest`.
pt_br: Este Gradle Plugin gera tarefas para cada sourceSet gerado pelo Gradle Java Plugin. Por exemplo, se você tem dois sourceSets `main` and `test`, este plugin gera duas tarefas: `spotbugsMain` and `spotbugsTest`.

source: Generated tasks uses compiled .class files as input, so it will run after java compilation runs (e.g. `classes` task). SpotBugs Gradle Plugin adds task dependency from `check` to these generated tasks, so you can simply run ``./gradlew check`` to run SpotBugs.
pt_br: As tarefas geradas usam como entrada os arquivos .class compilados, então so apenas serão executadas após a execução da compilação java (por exemplo, tarefas `classes`). SpotBugs Gradle Plugin adiciona uma dependência de tarefa de verificação `check` para as tarefas geradas, então você pode simplesmente usar o comando ``./gradlew check`` para executar o SpotBugs.

source: If you do not want to generate tasks automatically, use `the SpotBugs Base Plugin <https://plugins.gradle.org/plugin/com.github.spotbugs-base>`_ instead. This plugin does not generate tasks so you can configure from scratch.
pt_br: Se vocẽ não quer gerar tarefas automaticamente, em vez disso, use o `SpotBugs Base Plugin <https://plugins.gradle.org/plugin/com.github.spotbugs-base>`_. Este plugin não gera tarefas, então você pode configurar do zero.

source: This plugin uses the Extension to configure. Please check the document for `SpotBugsExtension <https://spotbugs-gradle-plugin.netlify.app/com/github/spotbugs/snom/SpotBugsExtension.html>`_.
pt_br: Este plugin usa o atributo Extension para configuração. Por favor, verifique o documento `SpotBugsExtension <https://spotbugs-gradle-plugin.netlify.app/com/github/spotbugs/snom/SpotBugsExtension.html>`_.

source: Other usage
pt_br: Outros usos

source: Visit `the official README <https://github.com/spotbugs/spotbugs-gradle-plugin#readme>`_ for detail.
pt_br: Visite `o README oficial <https://github.com/spotbugs/spotbugs-gradle-plugin#readme>`_ para mais detalhes.
