Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/gui.po
Languages: ja, pt_br

source: Using the SpotBugs GUI
ja: SpotBugs GUI の使い方
pt_br: Usando a interface do SpotBugs

source: This chapter describes how to use the SpotBugs graphical user interface (GUI).
ja: この章では，SpotBugs グラフィカルユーザインタフェース (GUI) の使い方について説明します。
pt_br: Este capítulo descreve como usar a interface gráfica do SpotBugs (GUI).

source: Creating a Project
ja: プロジェクトの作成
pt_br: Criação de um projeto

source: After you have started SpotBugs using the ``spotbugs`` command, choose the ``File → New Project`` menu item. You will see a dialog which looks like this:
ja: ``spotbugs`` コマンドを使って SpotBugs を起動したら，``File → New Project`` メニュー項目を選択します。次のようなダイアログが表示されます。
pt_br: Após a inicialização do SpotBugs usando o comando ``spotbugs``, escolha o item ``File → New Project`` no menu. Você verá uma caixa de diálogo parecida com a seguinte:

source: Use the "Add" button next to "Classpath to analyze" to select a Java archive file (zip, jar, ear, or war file) or directory containing java classes to analyze for bugs. You may add multiple archives/directories.
ja: 「Classpath to analyze」の横にある「Add」ボタンを使用して，バグを解析する Java アーカイブファイル (zip，jar，ear，war ファイル) または Java クラスを含むディレクトリを選択します。複数のアーカイブ/ディレクトリを追加できます。
pt_br: Use o botão "Add" próximo ao "Classpath to analyze" para selecionar um arquivo Java (zip, jar, ear, or war file) ou diretório contendo classes Java a serem analisadas. Você pode adicionar múltiplos arquivos e diretórios.

source: You can also add the source directories which contain the source code for the Java archives you are analyzing. This will enable SpotBugs to highlight the source code which contains a possible error. The source directories you add should be the roots of the Java package hierarchy. For example, if your application is contained in the ``org.foobar.myapp`` package, you should add the parent directory of the org directory to the source directory list for the project.
ja: また，解析をする Java アーカイブのソースコードを含むディレクトリを追加することもできます。そうすると，SpotBugs は発生する可能性があるエラーを含むソースコードを強調表示できます。追加するソースディレクトリは，Java パッケージ階層のルートにする必要があります。たとえば，アプリケーションが ``org.foobar.myapp`` パッケージに含まれているときは，org ディレクトリの親ディレクトリをプロジェクトのソースディレクトリに追加する必要があります。
pt_br: Você também pode adicionar os diretórios que contém o código dos arquivos Java que deseja analisar. Isso permitirá que o SpotBugs destaque o código que possui um possível erro. Os diretórios que você adicionar devem ser diretórios raiz na hierarquia de pacotes Java. Por exemplo, se sua aplicação está contida no pacote ``org.foobar.myapp``, você deve adicionar o diretório pai do diretório org para que o projeto seja listado.

source: Another optional step is to add additional Jar files or directories as "Auxiliary classpath locations" entries. You should do this if the archives and directories you are analyzing have references to other classes which are not included in the analyzed archives/directories and are not in the standard runtime classpath. Some of the bug pattern detectors in FindBugs make use of class hierarchy information, so you will get more accurate results if the entire class hierarchy is available which FindBugs performs its analysis.
ja: もうひとつのオプションの手順は，追加する jar ファイルやディレクトリを「Auxiliary classpath locations」エントリとして追加することです。解析するアーカイブ/ディレクトリにも標準のランタイムクラスパスにも含まれていないクラスをアーカイブ/ディレクトリが参照しているときは追加する必要があります。SpotBugs のバグパターンディテクタの中には，クラス階層情報を利用するものがあるため，SpotBugs が解析を行うクラス階層全体が利用可能なら，より正確な結果が得られます。
pt_br: outro passo adicional é a adição de arquivos Jar ou diretórios como entrada em "Auxiliary classpath locations". Você deve fazer isso se os arquivos ou diretórios que deseja analisar possuem referências para outras classes que não estão inclusas nos arquivos/diretórios e não estão inclusas no classpath padrão. Alguns dos detectores de padrões de bug no FindBugs usam informações da hierarquia de classes, então você pode obter resultados mais precisos se a hierarquia de classes está disponível.

source: Running the Analysis
ja: 解析の実行
pt_br: Execução da análise

source: Once you have added all of the archives, directories, and source directories, click the "Analyze" button to analyze the classes contained in the Jar files. Note that for a very large program on an older computer, this may take quite a while (tens of minutes). A recent computer with ample memory will typically be able to analyze a large program in only a few minutes.
ja: すべてのアーカイブ，ディレクトリ，ソースディレクトリを追加したら，「Analyze」ボタンをクリックして jar ファイルに含まれるクラスを解析します。古いコンピュータ上の巨大プロジェクトでは，かなりの時間 (数 10 分) かかることに注意してください。十分なメモリを備えた最近のコンピュータなら，大きなプログラムを数分で解析できます。
pt_br: Uma vez que você adicionou todos os arquivos e diretórios clique no botão "Analyze" para executar a análise classes contidas nos arquivos Jar. Observe que para um programa muito grande, em um computador antigo, a análise pode demorar bastante. Um computador mais atual, com bastante memória, é capaz de analisar um programa muito grande em poucos minutos.

source: Browsing Results
ja: 結果の閲覧
pt_br: Visualização dos resultados

source: When the analysis completes, you will see a screen like the following:
ja: 解析が完了すると，次のような画面が表示されます。
pt_br: Quando a análise terminar, você verá uma tela como a seguir:

source: The upper left-hand pane of the window shows the bug tree; this is a hierarchical representation of all of the potential bugs detected in the analyzed Jar files.
ja: ウィンドウの左上のペインにバグツリーが表示されます。これは，解析された jar ファイルで検出されたすべての潜在的なバグを階層的に表したものです。
pt_br: O painel superior esquerdo da janela mostra a árvore de bug; esta é uma

source: When you select a particular bug instance in the top pane, you will see a description of the bug in the "Details" tab of the bottom pane. In addition, the source code pane on the upper-right will show the program source code where the potential bug occurs, if source is available. In the above example, the bug is a stream object that is not closed. The source code window highlights the line where the stream object is created.
ja: 上部ペインで特定のバグインスタンスを選択すると，下部ペインの「Details」タブにバグの説明が表示されます。さらに，右上のソースコードペインには，ソースが利用可能であれば，潜在的なバグが発生する場所のプログラムソースコードが表示されます。上記の例では，バグはクローズされていないストリームオブジェクトです。ソースコードウィンドウは，ストリームオブジェクトが作成された行を強調表示します。
pt_br: Ao selecionar uma determinada instância de bug no painel superior, você verá uma descrição do bug na guia "Detais" no painel inferior. Além disso, o painel de código-fonte no canto superior direito mostrará o programa código-fonte onde ocorre o possível bug, se a fonte estiver disponível. No exemplo acima, o bug é um objeto de fluxo que não é fechado. A janela do código-fonte destaca a linha onde o objeto de fluxo é criado.

source: You may add a textual annotations to bug instances. To do so, type them into the text box just below the hierarchical view. You can type any information which you would like to record. When you load and save bug results files, the annotations are preserved.
ja: バグインスタンスにテキストで注釈を追加できます。階層ビューのすぐ下にあるテキストボックスに注釈を入力します。記録しておきたい情報を入力できます。バグ結果ファイルをロード，保存したときに，注釈も保存されます。
pt_br: Você pode adicionar anotações textuais às instâncias do bug. Para fazer isso, digite-as na caixa de texto logo abaixo da visualização hierárquica. Você pode digitar qualquer informação que gostaria de registrar. Quando você carrega e salva os arquivos de resultados do bug, as anotações são preservadas.

source: Saving and Opening
ja: 保存と開く
pt_br: Salvando e abrindo os arquivos

source: You may use the ``File → Save as...`` menu option to save your work. To save your work, including the jar file lists you specified and all bug results, choose "FindBugs analysis results (.xml)" from the drop-down list in the "Save as..." dialog. There are also options for saving just the jar file lists ("FindBugs project file (.fbp)") or just the results ("FindBugs analysis file (.fba)"). A saved file may be loaded with the ``File → Open...`` menu option.
ja: ``File → Save as...`` メニューオプションを使用するとユーザ作業を保存できます。指定した jar ファイルリストとすべてのバグ結果を含むユーザ作業を保存したいときは「Save as...」ダイアログのドロップダウンリストから「SpotBugs analysis results (.xml)」を選択します。jar ファイルリストだけを保存する (「FindBugs project file (.fbp)」)，結果だけを保存する (「FindBugs analysis file (.fba)」) オプションもあります。保存されたファイルは ``File → Open...`` メニューオプションでロードできます。
pt_br: Você pode usar a opção do menu ``File → Save as...`` para salvar seu trabalho. Para salvar seu trabalho, incluindo as listas de arquivos jar e todos os resultados de bugs, escolha "FindBugs analysis results (.xml)" no menu drop-down no diálogo "Save as...". Há outras opções para salvar apenas as listas de arquivos Jar ("FindBugs project file (.fbp)") ou apenas os resultados ("FindBugs analysis file (.fba)"). um arquivo salvo pode ser aberto na opção do menu ``File → Open...``.
