Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/implement-plugin.po
Languages: ja, pt_br

source: Implement SpotBugs plugin
ja: SpotBugs プラグインの実装
pt_br: Implementação do SpotBugs Plugin

source: Create Maven project
ja: Maven プロジェクトの作成
pt_br: Criação do projeto Maven

source: Use `spotbugs-archetype <https://github.com/spotbugs/spotbugs-archetype>`_ to create Maven project. Then Maven archetype plugin will ask you to decide plugin's groupId, artifactId, package and initial version.
ja: `spotbugs-archetype <https://github.com/spotbugs/spotbugs-archetype>`_ を使って Maven プロジェクトを作成してください。Maven archetype プラグインは，プラグインの groupId，artifactId，package，initial version を決定するように求めます。
pt_br: Use `spotbugs-archetype <https://github.com/spotbugs/spotbugs-archetype>`_ para criar o projeto Maven. Então, a arquitetura do Maven plugin pede para que você informe o groupId, artifactId, package e versão inicial do plugin.

source: Write java code to represent bug to find
ja: 見つけたいバグを表すコードを書く
pt_br: Escrita do código Java para representar o bug a ser encontrado

source: In generated project, you can find a file named as `BadCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/BadCase.java>`_. Update this file to represent the target bug to find.
ja: 生成されたプロジェクトでは `BadCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/BadCase.java>`_ という名前のファイルを見つけられます。見つけたい対象のバグを表すようにこのファイルを更新します。
pt_br: No projeto gerado, você pode encontrar um arquivo nomeado como `BadCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/BadCase.java>`_. Atualize esse arquivo para representar o bug a ser encontrado.

source: If you have multiple patterns to represent, add more classes into ``src/test/java`` directory.
ja: 表現するパターンが複数あるときは，``src/test/java`` ディレクトリにクラスを追加してください。
pt_br: Se você tem muitos padrões a serem representados, adicione mais classes no diretório ``src/test/java``.

source: Write test case to ensure your detector can find bug
ja: ディテクタがバグを見つけられるようにテストケースを書く
pt_br: Escreva casos de teste para garantir que seu detector pode encontrar bugs

source: In generated project, you can find another file named as `MyDetectorTest.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/MyDetectorTest.java>`_. The ``spotbugs.performAnalysis(Path)`` in this test runs SpotBugs with your plugin, and return all found bugs (here 1st argument of this method is a path of class file compiled from ``BadCase.java``).
ja: 生成されたプロジェクトでは `MyDetectorTest.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/MyDetectorTest.java>`_ という名前の別のファイルを見つけられます。このテストの ``spotbugs.performAnalysis(Path)`` はプラグインがある SpotBugs を実行し，見つかったバグをすべて返します (このメソッドの第 1 引数は ``BadCase.java`` からコンパイルされたクラスファイルのパスです)。
pt_br: No projeto gerado, você pode encontrar o arquivo nomeado como `MyDetectorTest.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/MyDetectorTest.java>`_. Nesse teste, o ``spotbugs.performAnalysis(Path)`` executa o SpotBugs com o seu plugin, e retorna todos os bugs encontrados (o primeiro argumento desse método é o caminho do arquivo de classe compilado a partir de ``BadCase.java``).

source: You can use `BugInstanceMatcher <https://github.com/spotbugs/spotbugs/blob/master/test-harness/src/main/java/edu/umd/cs/findbugs/test/matcher/BugInstanceMatcher.java>`_ to verify that your plugin can find bug as expected.
ja: `BugInstanceMatcher <https://github.com/spotbugs/spotbugs/blob/master/test-harness/src/main/java/edu/umd/cs/findbugs/test/matcher/BugInstanceMatcher.java>`_ でプラグインが期待したとおりにバグを見つけられることを確認します。
pt_br: Você pode usar `BugInstanceMatcher <https://github.com/spotbugs/spotbugs/blob/master/test-harness/src/main/java/edu/umd/cs/findbugs/test/matcher/BugInstanceMatcher.java>`_ para verificar que seu plugin pode encontrar bug como o esperado.

source: Currently this test should fail, because we've not updated detector itself yet.
ja: 現在このテストは失敗するはずです。なぜなら，まだディテクタを更新していないからです。
pt_br: Atualmente, esse teste deve falhar, porque não atualizamos o detector ainda.

source: Write java code to avoid false-positive
ja: 誤検出を回避するためのコードを書く
pt_br: Escrita de código Java para evitar falso-positivos

source: To avoid false-positive, it is good to ensure that in which case detector should NOT find bug.
ja: 誤検出を回避するために，どのようなときにディテクタがバグを見つけるべきでないかを確認することは良いことです。
pt_br: Para evitar falso positivos, é bom garantir os casos em que o detector NÃO deve encontrar um bug.

source: Update `GoodCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/GoodCase.java>`_ in your project, and represent such cases. After that, add a test method into ``MyDetectorTest.java`` which verify that no bug found from this ``GoodCase`` class.
ja: プロジェクトの `GoodCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/GoodCase.java>`_ を更新して，そのような例を表します。その後，``MyDetectorTest.java`` にテストメソッドを追加して，この ``GoodCase`` クラスからバグが見つからないことを確認します。
pt_br: Atualize `GoodCase.java <https://github.com/spotbugs/spotbugs-archetype/blob/spotbugs-archetype-0.1.0/src/main/resources/archetype-resources/src/test/java/GoodCase.java>`_ no seu projeto, e represente tais casos. Em seguida, adicione um método de teste em ``MyDetectorTest.java`` o qual verifica que não foram encontradas instâncias de bug na classe ``GoodCase``.

source: Update detector to pass all unit tests
ja: すべての単体試験に合格するようにディテクタを更新する
pt_br: Atualize o detector para passar em todos os testes de unidade

source: Now you have tests to ensure that your detector can work as expected.
ja: これで，ディテクタが期待どおりに動作することを確認するテストが実施されました。
pt_br: Agora você tem testes que garantem que seu detector funciona como o esperado.

source: Which super class you should choose
ja: 選ぶべきスーパークラス
pt_br: Qual super classe você deve escolher

source: Base detector which analyzes annotations on classes, fields, methods, and method parameters.
ja: クラス，フィールド，メソッド，メソッドパラメータに関するアノテーションを解析するベースディテクタです。
pt_br: Um detector base que analisa anotações em classes, campos, métodos e parâmetros de método.

source: Base detector which analyzes java bytecode in class files.
ja: クラスファイル内の Java バイトコードを解析するベースディテクタです。
pt_br: Um detector base que analisa Java bytecode em arquivos de classe.

source: Sub class of ``BytecodeScanningDetector``, which can scan the bytecode of a method and use an `operand stack <https://docs.oracle.com/javase/specs/jvms/se8/html/jvms-2.html#jvms-2.6.2>`_.
ja: ``BytecodeScanningDetector`` のサブクラスです。メソッドのバイトコードをスキャンし，`operand stack <https://docs.oracle.com/javase/specs/jvms/se8/html/jvms-2.html#jvms-2.6.2>`_ を使用できます。
pt_br: É uma subclasse de ``BytecodeScanningDetector``. Você pode verificar o bytecode do método e usar a pilha de operandos.

source: Update findbugs.xml
ja: findbugs.xml の更新
pt_br: Atualizar o findbugs.xml

source: SpotBugs reads ``findbugs.xml`` in each plugin to find detectors and bugs. So when you add new detector, you need to add new ``<Detector>`` element like below:
ja: SpotBugs は，それぞれのプラグインで ``findbugs.xml`` を読み出してディテクタとバグを見つけます。したがって，新しいディテクタを追加するときは，次のように新しい ``<Detector>`` 要素を追加する必要があります。
pt_br: O SpotBugs lê o arquivo ``findbugs.xml`` em cada plugin para encontrar os detectores e bugs.Portanto, ao adicionar um novo detector, você precisa adicionar o novo elemento ``<Detector>`` da seguinte maneira :

source: It is also necessary to add ``<BugPattern>``, to describe type and category of your bug pattern.
ja: また，バグパターンのタイプとカテゴリを記述するために ``<BugPattern>`` を追加する必要があります。
pt_br: Você também precisa adicionar ``<BugPattern>`` para descrever o tipo e a categoria do padrão de bug.

source: You can find ``findbugs.xml`` in ``src/main/resources`` directory of generated Maven project.
ja: 生成された Maven プロジェクトの ``src/main/resources`` ディレクトリに ``findbugs.xml`` があります。
pt_br: você pode encontrar o arquivo ``findbugs.xml`` no diretório ``src/main/resources`` do projeto Maven gerado

source: Update messages.xml
ja: messages.xml の更新
pt_br: Atualizar messages.xml

source: SpotBugs reads ``messages.xml`` in each plugin to construct human readable message to report detected bug. It also supports reading localized messages from ``messages_ja.xml``, ``messages_fr.xml`` and so on.
ja: SpotBugs は，それぞれのプラグインで ``messages.xml`` を読み出し，検出されたバグを報告するための人間が読めるメッセージを作成します。また，``messages_ja.xml``，``messages_fr.xml`` などローカライズされたメッセージを読み出すこともサポートしています。
pt_br: O SpotBugs lê o arquivo ``messages.xml`` em cada plugin e cria uma mensagem legível por humanos para relatar os bugs detectados. Além disso, ele também suporta a leitura de mensagens localizadas em ``messages_ja.xml``, ``messages_fr.xml`` e etc.

source: You can find ``messages.xml`` in ``src/main/resources`` directory of generated Maven project.
ja: 生成された Maven プロジェクトの ``src/main/resources`` ディレクトリに ``messages.xml`` があります。
pt_br: Você pode encontrar o arquivo ``messages.xml`` no diretório ``src/main/resources`` do projeto Maven gerado.

source: Update message of Detector
ja: ディテクタのメッセージの更新
pt_br: Atualizar a mensagem do Detector

source: In ``<Detector>`` element, you can add detector's description message. Note that it should be plain text, HTML is not supported.
ja: ``<Detector>`` 要素には，ディテクタを説明するメッセージを追加できます。メッセージはプレーンテキストでなければならず，HTMLはサポートされていないので注意してください。
pt_br: Você pode adicionar uma mensagem descritiva no elemento ``<Detector>``. Observe que a mensagem deve ser texto simples, HTML não é suportado.

source: Update message of Bug Pattern
ja: バグパターンのメッセージの更新
pt_br: Atualizar a mensagem de Bug Pattern

source: In ``<BugPattern>`` element, you can add bug pattern's description message. There are three kinds of messages:
ja: ``<BugPattern>`` 要素には，バグパターンを説明するメッセージを追加できます。3 種類のメッセージがります。
pt_br: Você pode adicionar uma mensagem descritiva no elemento ``<BugPattern>``. Há três tipos de mensagens:

source: Short description for bug pattern. Useful to tell its intent and character for users. It should be plain text, HTML is not supported.
ja: バグパターンの簡単な説明です。ユーザの意図やキャラクタを伝えるのに便利です。プレーンテキストでなければならず，HTMLはサポートされていません。
pt_br: Apresenta uma breve descrição de um padrão de bug. Essa mensagem é útil para comunicar as intenções e o caráter para os usuários. Deve ser texto simples e HTML não é compatível.

source: Longer description for bug pattern. You can use placeholder like ``{0}`` (0-indexed), then added data into `BugInstance <https://javadoc.io/page/com.github.spotbugs/spotbugs/latest/edu/umd/cs/findbugs/BugInstance.html>`_ will be inserted at there. So this ``LongDescription`` is useful to tell detailed information about detected bug.
ja: バグパターンのより長い説明です。``{0}`` (0 はインデックス) のようなプレースホルダを使うことができ，`BugInstance <https://javadoc.io/page/com.github.spotbugs/spotbugs/latest/edu/umd/cs/findbugs/BugInstance.html>`_ がそこに挿入されます。この ``LongDescription`` は検出されたバグの詳細情報を伝えるのに便利です。
pt_br: Apresenta uma descrição mais longa do padrão de bug. Você pode usar um espaço reservado como ``{0}`` (0-índice) e os dados de `BugInstance <https://javadoc.io/page/com.github.spotbugs/spotbugs/latest/edu/umd/cs/findbugs/BugInstance.html>`_ serão inseridos nesse espaço. Portanto, o ``LongDescription`` é útil para fornecer informações detalhadas

source: It should be plain text, HTML is not supported.
ja: プレーンテキストでなければならず，HTMLはサポートされていません。
pt_br: Deve ser texto simples e HTML não é compatível.

source: Details
pt_br: Detalhes

source: Detailed description for bug pattern. It should be HTML format, so this is useful to tell detailed specs/examples with table, list and code snippets.
ja: バグパターンの詳細な説明です。HTML 形式でなければなりません。詳細な仕様/例を表，リスト，コードスニペットで伝えるのに便利です。
pt_br: Uma descrição detalhada do padrão de bug. Deve estar no formato HTML para comunicar especificações/exemplos detalhados em tabelas, listas e fragmentos de código.
