Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/introduction.po
Languages: ja, pt_br

source: Introduction
ja: はじめに
pt_br: Introdução

source: SpotBugs is a program to find bugs in Java programs. It looks for instances of "bug patterns" --- code instances that are likely to be errors.
ja: SpotBugs は，Java プログラムの中のバグを見つけるプログラムです。このプログラムは「バグパターン」のインスタンスを探します。「バグパターン」とは，エラーとなる可能性の高いコードのインスタンスです。
pt_br: SpotBugs é um programa para encontrar bugs em programas Java. Ele procura por instâncias de "padrões de bugs" --- instâncias de código que podem ser erros.

source: This document describes version |release| of SpotBugs. We are very interested in getting your feedback on SpotBugs. Please visit the SpotBugs web page for the latest information on SpotBugs, contact information, and support resources such as information about the SpotBugs GitHub organization.
ja: この文書では，SpotBugs のバージョン |release| について説明します。私たちは，SpotBugs に対するフィードバックを心待ちにしています。SpotBugs の最新情報，連絡先，SpotBugs GitHub 組織に関する情報などのサポートリソースは SpotBugs のウェブページを参照してください。
pt_br: Este documento descreve a versão |release| do SpotBugs. Estamos muito interessados em saber sua opinião sobre o SpotBugs. Por favor, visite a página do SpotBugs para obter a última versão do SpotBugs, informações de contato, e suporte como informações sobre o SpotBugs e organização no GitHub.

source: Requirements
ja: 必要条件
pt_br: Requisitos

source: To use SpotBugs, you need a runtime environment compatible with Java version 1.8 or later. SpotBugs is platform independent, and is known to run on GNU/Linux, Windows, and MacOS X platforms.
ja: SpotBugs を使うためには，Java バージョン 1.8 以降のバージョンと互換性のあるランタイム環境が必要です。SpotBugs は，プラットフォームに依存せず，GNU/Linux，Windows，MacOS X で動作することが知られています。
pt_br: Para usar SpotBugs, você precisa de um ambiente compatível com Java versão 1.8 ou posterior. SpotBugs é uma plataforma independente, e é conhecida por rodar nas plataformas GNU/Linux, Windows, e MacOS X.

source: You should have at least 512 MB of memory to use SpotBugs. To analyze very large projects, more memory may be needed.
ja: SpotBugs を使うためには，少なくとも 512MB のメモリが必要です。巨大なプロジェクトを解析するためには，より多くのメモリが必要になることがあります。
pt_br: Você precisa ter pelo menos 512 MB de memória para usar o SpotBugs. Para analisar projetos muito grandes, você pode precisar de mais memória.

source: Supported Java version
ja: サポートされているJavaバージョン
pt_br: Versões Java suportadas

source: SpotBugs is built by JDK8, and run on JRE8 and newer versions.
ja: SpotBugsはJDK8でビルドされています。またJRE8以上で動作します。
pt_br: SpotBugs é construído pelo JDK8 e executado no JRE8 ou versões posteriores.

source: SpotBugs can scan bytecode (class files) generated by JDK8 and newer versions. However, support for Java 11 and newer is still experimental. Visit `issue tracker <https://github.com/spotbugs/spotbugs/issues>`_ to find known problems.
ja: SpotBugsはバージョン8以降のJDKによって生成されたバイトコード（クラスファイル）を解析できます。しかし、Java 11以降へのサポートは未だ実験的なものです。既知の問題点は`イシュー管理システム <https://github.com/spotbugs/spotbugs/issues>`_ で確認してください。
pt_br: SpotBugs pode escanear bytecode (arquivos de classe) gerados pelo JDK8 ou versões posteriores. No entanto, o suporte para Java 11 e versões posteriores ainda é experimental. Visite o `issue tracker <https://github.com/spotbugs/spotbugs/issues>`_ para encontrar problemas conhecidos.

source: SpotBugs does not support bytecode (class files) generated by outdated JDK such as 10, 9, 7 and older versions.
ja: SpotBugsはサポートが切れたJDKバージョン10、9および7以前によって生成されたバイトコード（クラスファイル）の解析をサポートしません。
pt_br: SpotBugs não suporta bytecode (arquivos de classe) gerados por JDK desatualizado como as versões 10, 9, 7 ou anteriores.
