Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/links.po
Languages: pt_br

source: SpotBugs Links
pt_br: Links para o SpotBugs

source: This page contains links to related projects, including tools that are similar to SpotBugs.
pt_br: Esta página contém links para projetos relacionados, incluindo ferramentas que são similares ao SpotBugs.

source: IDE Integration
pt_br: Integração com IDE

source: An Eclipse plugin which configures the FindBugs/SpotBugs Eclipse plugin to match the FindBugs/SpotBugs Maven plugin.
pt_br: Um plugin para o Eclipse que configura o plugin FindBugs/SpotBugs para corresponder ao plugin FindBugs/SpotBugs Maven.

source: The SpotBugs Plugin for IntelliJ IDEA.
pt_br: O plugin SpotBugs para o IntelliJ IDEA

source: SpotBugs Plugins
pt_br: Plugins para o SpotBugs

source: A FindBugs/SpotBugs plugin for doing static code analysis on java byte code.
pt_br: Um plugin para FindBugs/SpotBugs para realizar análise estática em Java bytecode.

source: A FindBugs/SpotBugs plugin for security audits of Java web applications.
pt_br: Um pluign para o FindBugs/SpotBugs para auditoria de segurança para aplicações Java web.

source: A FindBugs/SpotBugs plugin to verify usage of `SLF4J <https://www.slf4j.org/>`_.
pt_br: Um plugin para o FindBugs/SpotBugs para verificar o uso de `SLF4J <https://www.slf4j.org/>`_.

source: Similar/Related Tools
pt_br: Ferramentas similares ou relacionadas

source: A `SonarQube <https://www.sonarqube.org/>`_ plugin which provides rules based on SpotBugs and its major plugins.
pt_br: O `SonarQube <https://www.sonarqube.org/>`_ plugin provê regras baseadas no SpotBugs e seus principais plugins.

source: A style checker for Java.
pt_br: Um analisador de estilo para Java.

source: An extensible cross-language static code analyzer.
pt_br: Um analisador de código estático extensível em várias linguagens.

source: New Java bytecode static analyzer tool based on `Procyon Compiler Tools <https://github.com/mstrobel/procyon>`_ aimed to supersede the FindBugs.
pt_br: Nova ferramenta de análise estática de bytecode Java baseada em `Procyon Compiler Tools <https://github.com/mstrobel/procyon>`_ com o objetivo de substituir o FindBugs.

source: A static analysis tool for Java that catches common programming mistakes at compile-time.
pt_br: Uma ferramenta de análise estática para Java que detecta erros de programação comuns em tempo de compilação.

source: A pluggable type-checking for Java.
pt_br: Um framework que inclui analisadores de tipo para Java.

source: `FindBugs-IDEA <https://plugins.jetbrains.com/plugin/3847-findbugs-idea>`_ (outdated)
pt_br: `FindBugs-IDEA <https://plugins.jetbrains.com/plugin/3847-findbugs-idea>`_ (desatualisado)

source: The FindBugs plugin for `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_.
pt_br: O plugin FindBugs para `IntelliJ IDEA <https://www.jetbrains.com/idea/>`_.
