Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/maven.po
Languages: ja, pt_br

source: Using the SpotBugs Maven Plugin
ja: SpotBugs Maven プラグインの使い方
pt_br: Usando o SpotBugs Maven Plugin

source: This chapter describes how to integrate SpotBugs into a Maven project.
ja: この章では，Maven プロジェクトに SpotBugs を統合する方法について説明します。
pt_br: Este capítulo descreve como integrar o SpotBugs em projetos Maven.

source: Add spotbugs-maven-plugin to your pom.xml
ja: pom.xml に spotbugs-maven-plugin を追加する
pt_br: Adição do spotbugs-maven-plugin

source: Add ``<plugin>`` into your ``pom.xml`` like below:
ja: 次のように ``pom.xml`` に ``<plugin>`` を追加してください。
pt_br: Adicione o ``<plugin>`` no arquivo ``pom.xml`` como no código abaixo:

source: Integrate Find Security Bugs into spotbugs-maven-plugin
pt_br: Integração do Find Security Bugs no spotbugs-maven-plugin

source: Are you looking for additional security detectors for SpotBugs? We suggest you to check the `Find Security Bugs <https://find-sec-bugs.github.io/>`_ a SpotBugs plugin for security audits of Java web and Android applications. It can detect 138 different vulnerability types, including SQL/HQL Injection, Command Injection, XPath Injection, and Cryptography weaknesses.
pt_br: Voê está procurando por detectores de segurança adicionais para o SpotBugs? Sugerimos que você veja o `Find Security Bugs <https://find-sec-bugs.github.io/>`_ um plugin para o SpotBugs para auditoria de segurança de aplicações Java webAndroid. O plugin pode detectar 138 tipos de vulnerabilidades diferentes, incluindo SQL/HQL Injection, Command Injection, XPath Injection, e Cryptography weaknesses.

source: To integrate Find Security Bugs into SpotBugs plugin, you can configure your ``pom.xml`` like below:
pt_br: Para integrar o Find Security Bugs no SpotBugs, você pode configurar o arquivo ``pom.xml`` como mostrado a seguir:

source: The ``<plugins>`` option defines a collection of PluginArtifact to work on. Please, specify "Find Security Bugs" by adding its groupId, artifactId, version.
pt_br: A opção ``<plugins>`` define uma coleção de artefatos para utilizar o plugin. Por favor, especifique "Find Security Bugs" por meio da adição de seu groupId, artifactId, e version.

source: The ``<includeFilterFile>`` and ``<excludeFilterFile>`` specify the filter files to include and exclude bug reports, respectively (see `Filter file <https://spotbugs.readthedocs.io/en/latest/filter.html>`_ for more details). Optionally, you can limit the research to the security category by adding files like below:
pt_br: As opções ``<includeFilterFile>`` e ``<excludeFilterFile>`` especificam os arquivos de filtro para a inclusão e exclusão de reporte de bugs, respectivamente (veja `Arquivos de filtro <https://spotbugs.readthedocs.io/en/latest/filter.html>`_ para mais detalhes). Opcionalmente, você pode limitar a busca apenas a categoria de segurança por meio da adição de arquivos como:

source: Goals of spotbugs-maven-plugin
ja: spotbugs-maven-plugin のゴール
pt_br: Objetivos do spotbugs-maven-plugin

source: spotbugs goal
ja: spotbugs ゴール
pt_br: Meta: spotbugs

source: ``spotbugs`` goal analyses target project by SpotBugs. For detail, please refer `spotbugs goal description in maven site <https://spotbugs.github.io/spotbugs-maven-plugin/spotbugs-mojo.html>`_.
ja: ``spotbugs`` ゴールは，SpotBugs によるターゲットプロジェクトの解析をします。詳細については，`maven サイトの spotbugs ゴールの説明 <https://spotbugs.github.io/spotbugs-maven-plugin/spotbugs-mojo.html>`_ を参照してください。
pt_br: A meta ``spotbugs`` analisa o projeto selecionado com o SpotBugs. Para detalhes, consulte `spotbugs goal no site <https://spotbugs.github.io/spotbugs-maven-plugin/spotbugs-mojo.html>`_.

source: check goal
ja: check ゴール
pt_br: Meta: check

source: ``check`` goal runs analysis like ``spotbugs`` goal, and make the build failed if it found any bugs. For detail, please refer `check goal description in maven site <https://spotbugs.github.io/spotbugs-maven-plugin/check-mojo.html>`_.
ja: ``check`` ゴールは，``spotbugs`` ゴールのような解析を行い，バグが見つかったらビルドが失敗します。詳細については，`maven サイトの check ゴールの説明 <https://spotbugs.github.io/spotbugs-maven-plugin/check-mojo.html>`_ を参照してください。
pt_br: A meta ``check`` executa a análise com a meta ``spotbugs``, e faz a compilação falhar se não forem encontrados bugs. Para detalhes, consulte `check goal no site <https://spotbugs.github.io/spotbugs-maven-plugin/check-mojo.html>`_.

source: gui goal
ja: gui ゴール
pt_br: Meta: gui

source: ``gui`` goal launches SpotBugs GUI to check analysis result. For detail, please refer `gui goal description in maven site <https://spotbugs.github.io/spotbugs-maven-plugin/gui-mojo.html>`_.
ja: ``gui`` ゴールは，SpotBugs GUI を起動し，解析結果を確認します。詳細については，`maven サイトの gui ゴール <https://spotbugs.github.io/spotbugs-maven-plugin/gui-mojo.html>`_ を参照してください。
pt_br: A meta ``gui`` inicia a interface SpotBugs GUI para verificar o resultado da análise. Para detalhes consulte `gui goal description no site <https://spotbugs.github.io/spotbugs-maven-plugin/gui-mojo.html>`_.

source: help goal
ja: help ゴール
pt_br: Meta: help

source: ``help`` goal displays usage of this Maven plugin.
ja: ``help`` ゴールは，この Maven プラグインの使い方を表示します。
pt_br: a meta ``help`` apresenta os modos de uso deste Maven plugin.
