Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/migration.po
Languages: ja, pt_br

source: Guide for migration from SpotBugs 3.1 to 4.0
ja: SpotBugs 3.1から4.0への移行ガイド
pt_br: Guia para migração do SpotBugs 3.1 para 4.0

source: for SpotBugs Users
ja: SpotBugsユーザ向け
pt_br: Para usuários do SpotBugs

source: SpotBugs now use SLF4J instead of calling STDERR/STDOUT directly. So when you run SpotBugs, it is recommended to have a SLF4J binding in classpath.
ja: SpotBugsは標準入出力を直接使うのではなく、SLF4Jを使うようになりました。よってSpotBugs実行時はSLF4Jバインディングがひとつクラスパスに含まれている必要があります。
pt_br: Atualmente, o SpotBugs usa SLF4J em vez de chamar o STDERR/STDOUT diretamente. Portanto, é recomendado que se tenha o SLF4J vinculado ao classpath para executar o SpotBugs.

source: SQL files in SpotBugs project are dropped. Generally it does not affect your usage.
ja: SpotBugsプロジェクトに含まれていたSQLファイルは削除されました。これは基本的な用途には影響しません。
pt_br: Os arquivos SQL contidos no projeto SpotBugs foram removidos. Geralmente, isso não afeta seu uso.

source: JNLP (Applet) support is dropped.
ja: JNLP (Applet)のサポートは廃止されました。
pt_br: O suporte para JNLP (Applet) foi descontinuado.

source: for Plugin Developers
ja: プラグイン開発者向け
pt_br: Para desenvolvedores de plugins

source: The `speed` attribute of `Detector` element in `findbugs.xml` is deprecated.
ja: `findbugs.xml` に含まれる `Detector` 要素の `speed` 属性は非推奨になりました。
pt_br: O atributo `speed` do elemento `Detector` em `findbugs.xml` foi descontinuado.

source: The dependency on `jaxen` has been changed to `runtime` scope. Generally it does not affect your project because SpotBugs does not depend on it directly.
ja: `jaxen` への依存が `runtime` スコープに変更されました。SpotBugsはこれに直接依存してはいないため、プラグインプロジェクトには影響しません。
pt_br: A dependência do `jaxen` foi alterada para o escopo `runtime`. De modo geral, isso não afeta o seu projeto porque SpotBugs não depende dele diretamente.

source: The dependency on `Saxon-HE` has added as a `runtime` scope dependency.
ja: `Saxon-HE` への依存が `runtime` スコープで追加されました。
pt_br: A dependência de `Saxon-HE` foi adicionada como uma dependência de escopo `runtime`.

source: Some deprecated APIs have been removed, refer the javadoc and migrate to preferred API before you migrate to SpotBugs 4.0.
ja: いくつかの非推奨だったAPIが削除されました。4.0へ移行する前に、Javadocを参考に推奨されたAPIに移行してください。
pt_br: Algumas APIs obsoletas foram removidas. Antes de migrar para o SpotBugs 4.0, consulte o javadoc e migre para a API recomendada.

source: Guide for migration from FindBugs 3.0 to SpotBugs 3.1
ja: FindBugs 3.0からSpotBugs 3.1 への移行ガイド
pt_br: Guia para migração do FindBugs 3.0 para o SpotBugs 3.1

source: Simply replace ``com.google.code.findbugs:findbugs`` with ``com.github.spotbugs:spotbugs``.
ja: ``com.google.code.findbugs:findbugs`` を ``com.github.spotbugs:spotbugs`` に替えてください。
pt_br: Basta substituir ``com.google.code.findbugs: findbugs`` por ``com.github.spotbugs: spotbugs``.

source: JSR305 is already Dormant status, so SpotBugs does not release ``jsr305`` jar file. Please continue using findbugs' one.
ja: JSR305は、すでに休止状態なので、SpotBugsは ``jsr305`` jarファイルをリリースしません。FindBugs のものを使い続けてください。
pt_br: JSR305 já está com status inativo. Dessa forma, o SpotBugs não liberará o arquivo jar ``jsr305``.Por favor, continue usando o referente ao findbugs.

source: Please depend on ``spotbugs-annotations`` instead.
ja: 代わりに ``spotbugs-annotations`` に依存してください。
pt_br: Em vez disso, use ``spotbugs-annotations``.

source: Please depend on both of ``spotbugs-annotations`` and ``com.github.stephenc.jcip:jcip-annotations:1.0-1`` instead.
ja: 代わりに ``spotbugs-annotations`` と ``com.github.stephenc.jcip:jcip-annotations:1.0-1`` の両方に依存してください。
pt_br: Em vez disso, use de ``spotbugs-annotations`` e ``com.github.stephenc.jcip:jcip-annotations: 1.0-1``.

source: FindBugs Ant task
ja: FindBugs Ant タスク

source: Please replace ``findbugs-ant.jar`` with ``spotbugs-ant.jar``.
ja: ``findbugs-ant.jar`` を ``spotbugs-ant.jar`` に替えてください。
pt_br: Substitua ``findbugs-ant.jar`` por ``spotbugs-ant.jar``.

source: FindBugs Maven plugin
ja: FindBugs Maven プラグイン

source: Please use `com.github.spotbugs:spotbugs-maven-plugin` instead of `org.codehaus.mojo:findbugs-maven-plugin`.
ja: `org.codehaus.mojo:findbugs-maven-plugin` の代わりに `com.github.spotbugs:spotbugs-maven-plugin` を使用してください。
pt_br: Por favor, use `com.github.spotbugs: spotbugs-maven-plugin` em vez de `org.codehaus.mojo: findbugs-maven-plugin`.

source: FindBugs Gradle plugin
ja: FindBugs Gradle プラグイン

source: Please use spotbugs plugin found on https://plugins.gradle.org/plugin/com.github.spotbugs
ja: https://plugins.gradle.org/plugin/com.github.spotbugsにあるspotbugs プラグインを使用してください。
pt_br: Por favor, use o plugin Spotbugs disponível em https://plugins.gradle.org/plugin/com.github.spotbugs

source: FindBugs Eclipse plugin
ja: FindBugs Eclipse プラグイン

source: Please use following update site instead.
ja: 代わりに次の更新サイトをご利用ください。
pt_br: Por favor, use o seguinte site de atualização.

source: https://spotbugs.github.io/eclipse/ (to use stable version)
ja: https://spotbugs.github.io/eclipse/ (安定バージョンを使用する)
pt_br: https://spotbugs.github.io/eclipse/ (versão estável)

source: https://spotbugs.github.io/eclipse-candidate/ (to use candidate version)
ja: https://spotbugs.github.io/eclipse-candidate/ (候補バージョンを使用する)
pt_br: https://spotbugs.github.io/eclipse-candidate/ (versão candidata)

source: https://spotbugs.github.io/eclipse-latest/ (to use latest build)
ja: https://spotbugs.github.io/eclipse-latest/ (最新のビルドを使用する)
pt_br: https://spotbugs.github.io/eclipse-latest/ (última construção)
