Repository: spotbugs/spotbugs
Catalog: docs/locale/*/LC_MESSAGES/use-plugin-on-sonarqube.po
Languages: pt_br

source: Use SpotBugs Plugin on SonarQube
pt_br: Uso do SpotBugs Plugin no SonarQube

source: `The SpotBugs SonarQube Plugin <https://github.com/spotbugs/sonar-findbugs>`_ uses major SpotBugs plugins such as `fb-contrib <http://fb-contrib.sourceforge.net/>`_ and `Find Security Bugs <http://h3xstream.github.io/find-sec-bugs/>`_. However, if you want to use another SpotBugs plugin, you need to build your own SonarQube plugin. For detailed requirements on SonarQube plugins, see `the SonarQube official guidelines`_.
pt_br: O `SpotBugs SonarQube Plugin <https://github.com/spotbugs/sonar-findbugs>`_ usa os principais plugins do SpotBugs, como `fb-contrib <http://fb-contrib.sourceforge.net/>`_ and `Find Security Bugs <http://h3xstream.github.io/find-sec-bugs/>`_. No entanto, se quiser usar outro plugin, você precisa criar seu próprio plugin SonarQube. Para obter os requisitos detalhados dos plugins do SonarQube, consulte as `diretrizes oficiais do SonarQube`_.

source: Create Maven Project
pt_br: Criação do projeto Maven

source: Follow the interaction in the `SonarQube official guidelines <https://docs.sonarqube.org/latest/extend/developing-plugin/>`_. It is recommended to use sub-modules, to manage both the SpotBugs plugin and the SonarQube plugin in one project. You can refer to `this module <https://github.com/KengoTODA/guava-helper-for-java-8/tree/master/sonarqube-plugin>`_ as an example.
pt_br: Siga as `diretrizes oficiais do SonarQube <https://docs.sonarqube.org/latest/extend/developing-plugin/>`_. Recomenda-se o uso de submódulos para gerenciar o SpotBugs plugin e o SonarQube plugin em um projeto. Consulte esse `módulo <https://github.com/KengoTODA/guava-helper-for-java-8/tree/master/sonarqube-plugin>`_ como exemplo.

source: You also need to configure the ``sonar-packaging-maven-plugin``, to make your plugin depend on `the SpotBugs SonarQube Plugin <https://github.com/spotbugs/sonar-findbugs>`_. For instance, if you're using SonarQube 6.7 LTS, your plugin requires SpotBugs SonarQube Plugin version 3.7, so your configuration should be like below:
pt_br: Você também precisa configurar o ``sonar-packaging-maven-plugin`` para que seu plugin dependa do `SpotBugs SonarQube Plugin <https://github.com/spotbugs/sonar-findbugs>`_. Por exemplo, se você estiver usando o SonarQube 6.7 LTS, seu plugin requer o SpotBugs SonarQube Plugin na versão 3.7. Sua configuração deve ser:

source: Generate rules.xml
pt_br: Geração do arquivo rules.xml

source: SonarQube doesn't understand the Bug Pattern metadata provided for SpotBugs, so we need to convert ``findbugs.xml`` and ``messages.xml`` to the SonarQube format named ``rules.xml``.
pt_br: o SonarQube não entende os metadados de Bug Pattern fornecidos pelo SpotBugs. Dessa forma, é necessário converter ``findbugs.xml`` e ``messages.xml`` para o formato do sonarQube nomeado como ``rules.xml``.

source: If your SpotBugs plugin isn't complex, you can simply introduce `the SonarQube rule xml generator Maven Plugin <https://github.com/KengoTODA/sonarqube-rule-xml-generator>`_ to generate ``rules.xml``. Follow `the interaction described in its README <https://github.com/KengoTODA/sonarqube-rule-xml-generator#how-to-use>`_.
pt_br: Se seu SpotBugs plugin não é complexo, você pode utilizar o `SonarQube rule xml generator Maven Plugin <https://github.com/KengoTODA/sonarqube-rule-xml-generator>`_ para gerar o arquivo ``rules.xml``. Siga as instruções descritas no `README <https://github.com/KengoTODA/sonarqube-rule-xml-generator#how-to-use>`_.

source: Update RulesDefinition.java
pt_br: Atualização da classe RulesDefinition.java

source: Your ``SonarQubeRulesDefinition.java`` should load the generated ``rules.xml`` to the FindBugs repository.
pt_br: Seu ``SonarQubeRulesDefinition.java`` deve carregar o arquivo ``rules.xml`` para o repositório do FindBugs.

source: When you create a ``NewRepository`` instance, use ``FindbugsRulesDefinition.REPOSITORY_KEY`` as the repository key, and do _not_ rename it by calling ``NewRepository#setName(String)``. It is necessary to fulfill the requirement from `SonarQube API <https://github.com/SonarSource/sonarqube/blob/6.7.4/sonar-plugin-api/src/main/java/org/sonar/api/server/rule/RulesDefinition.java#L393-L395>`_. Here is an example:
pt_br: Ao criar uma nova instância ``NewRepository``, use ``FindbugsRulesDefinition.REPOSITORY_KEY`` como chave do repositório, e não a renomeia com o nome ``NewRepository#setName(String)``. Isso é necessário para satisfazer o requisito da `SonarQube API <https://github.com/SonarSource/sonarqube/blob/6.7.4/sonar-plugin-api/src/main/java/org/sonar/api/server/rule/RulesDefinition.java#L393-L395>`_. Por exemplo:

source: Update Plugin.java
pt_br: Atualização da classe Plugin.java

source: ``Plugin.java`` should be a simple implementation that just loads your ``RulesDefinition`` class. Here is an example:
pt_br: A classe ``Plugin.java`` deve ser uma implementação simples que apenas carrega a classe``RulesDefinition``. Por exemplo:

source: Deploy onto SonarQube
pt_br: Deploy no SonarQube

source: ``mvn package`` will generate a ``.jar`` file that works as a SonarQube plugin. Follow `the SonarQube official guidelines`_ to deploy it onto SonarQube.
pt_br: O comando ``mvn package`` gera um arquivo ``.jar`` que funciona como um SonarQube plugin. Siga as `diretrizes oficiais do SonarQube`_ para implantação no SonarQube.

source: Note that you need to enable new rules manually in your SonarQube profile, or newly added rules will not be used at analysis.
pt_br: Observe que você precisa habilitar as regras manualmente no seu perfil do SonarQube ou as novas regras adicionadas não serão utilizadas na análise.
